{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_1",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            32
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "dense_4_input"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_4",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "weights": [
          [
            -0.1902899295091629,
            -0.048164259642362595,
            -0.11675573140382767,
            0.2541859745979309,
            0.19502297043800354,
            -0.1296190321445465,
            0.12377599626779556,
            -0.20752958953380585,
            0.09001068770885468,
            0.002229116391390562,
            -0.17723733186721802,
            -0.18413789570331573,
            0.08794809877872467,
            0.12385242432355881,
            -0.1597566455602646,
            0.08845913410186768,
            -0.13224951922893524,
            -0.20250250399112701,
            -0.1220470666885376,
            0.17026156187057495,
            0.03662397712469101,
            0.10021936893463135,
            -0.24279822409152985,
            0.1126960888504982,
            -0.12203706055879593,
            -0.2573413848876953,
            -0.12879294157028198,
            0.13192367553710938,
            -0.039091967046260834,
            0.02661757916212082,
            0.12209275364875793,
            -0.08841532468795776,
            0.0004901789361611009,
            0.026590196415781975,
            0.15984129905700684,
            0.0663275346159935,
            0.22301213443279266,
            0.037997838109731674,
            0.36050015687942505,
            0.0405336394906044,
            -0.21144163608551025,
            0.17225290834903717,
            -0.20229284465312958,
            0.14358358085155487,
            0.1110202819108963,
            0.20427276194095612,
            -0.17038778960704803,
            0.1395503729581833,
            -0.19834032654762268,
            -0.23064696788787842,
            0.23321987688541412,
            -0.1698412448167801,
            0.0051103453151881695,
            -0.1356956511735916,
            -0.3459858000278473,
            -0.02410705015063286,
            0.04100305587053299,
            0.06357572972774506,
            -0.17164194583892822,
            -0.0038479496724903584,
            -0.16548827290534973,
            -0.119424007833004,
            0.12642177939414978,
            0.05770256370306015
          ],
          [
            0.03488236665725708,
            0.010612529702484608,
            0.10056644678115845,
            -0.060452453792095184,
            -0.08533802628517151,
            -0.12017156183719635,
            -0.7516291737556458,
            0.11248485743999481,
            -0.4050295650959015,
            0.11516480147838593,
            -0.3907826244831085,
            -0.1421920657157898,
            -0.7033746838569641,
            0.3155529499053955,
            -0.5611598491668701,
            0.13618841767311096,
            -0.21471180021762848,
            0.05215923860669136,
            0.049904122948646545,
            0.09019782394170761,
            -0.08114266395568848,
            -0.3776452839374542,
            0.5132228136062622,
            -0.02824467234313488,
            0.1189269870519638,
            -0.17498615384101868,
            0.04095005616545677,
            0.08539765328168869,
            -0.1470969021320343,
            -0.7527588605880737,
            -0.37092164158821106,
            -0.04521987587213516,
            -0.12072905898094177,
            0.17785631120204926,
            -0.08549240976572037,
            0.04549930617213249,
            -0.4200807213783264,
            -0.3579740524291992,
            0.010866017080843449,
            -0.1669451743364334,
            -0.16858729720115662,
            -0.17713496088981628,
            -0.1859923005104065,
            -0.14537803828716278,
            -0.3955049216747284,
            0.15915177762508392,
            -0.02019478566944599,
            -0.22364918887615204,
            -0.02442196011543274,
            -0.041298627853393555,
            0.24470651149749756,
            -0.2506183981895447,
            -0.014913922175765038,
            -0.239357590675354,
            0.0065748742781579494,
            -0.20311373472213745,
            -0.39407864212989807,
            0.01809694990515709,
            0.4719766676425934,
            -0.036108747124671936,
            -0.24859941005706787,
            -0.06560617685317993,
            -0.4603367745876312,
            -0.256633996963501
          ],
          [
            -0.10595109313726425,
            0.09344395250082016,
            0.15123288333415985,
            -0.38561534881591797,
            -0.055172909051179886,
            0.03927251696586609,
            -0.17078924179077148,
            0.04775378853082657,
            -0.07197476178407669,
            -0.023707788437604904,
            0.48309195041656494,
            0.1647171676158905,
            -0.42244961857795715,
            -0.25261929631233215,
            0.3013952076435089,
            -0.5106099247932434,
            0.10682220757007599,
            0.33334752917289734,
            0.35842931270599365,
            -0.038430821150541306,
            0.30076658725738525,
            -0.06066058203577995,
            -0.13142715394496918,
            0.1894233524799347,
            -0.4518357217311859,
            0.057472337037324905,
            0.2544642388820648,
            -0.5070041418075562,
            -0.10008018463850021,
            0.05792589858174324,
            0.013183764182031155,
            -0.1262926161289215,
            -0.061288800090551376,
            0.32877427339553833,
            0.3322458863258362,
            -0.14204324781894684,
            -0.4794546365737915,
            -0.15727028250694275,
            -0.2922402620315552,
            0.13650597631931305,
            -0.06540268659591675,
            -0.588472306728363,
            -0.1651591807603836,
            -0.2993963062763214,
            -0.3149828016757965,
            -0.13398027420043945,
            -0.27832111716270447,
            -0.12793102860450745,
            0.562257707118988,
            -0.23797428607940674,
            -0.3817331790924072,
            0.04521702975034714,
            0.015105915255844593,
            0.32291296124458313,
            -0.1681172251701355,
            -0.037101343274116516,
            0.11272914707660675,
            0.0020865213591605425,
            0.35850414633750916,
            -0.21232543885707855,
            0.10959035903215408,
            -0.22515562176704407,
            -0.005484217312186956,
            0.020990358665585518
          ],
          [
            -0.11647932231426239,
            0.2252577543258667,
            0.2937423586845398,
            -0.0799809992313385,
            0.15091277658939362,
            -0.023210633546113968,
            -0.45664268732070923,
            0.48968079686164856,
            -0.33956724405288696,
            0.08837458491325378,
            0.22824187576770782,
            0.17859052121639252,
            0.030156554654240608,
            0.20324701070785522,
            0.003937421832233667,
            -0.16456395387649536,
            0.5031749606132507,
            -0.15295818448066711,
            0.24000059068202972,
            -0.11695559322834015,
            -0.2269865721464157,
            -0.34874895215034485,
            0.07403919845819473,
            -0.28240254521369934,
            -0.07946256548166275,
            -0.12394651770591736,
            0.17663870751857758,
            -0.2897966206073761,
            0.1544787883758545,
            -0.10624466091394424,
            -0.05277425795793533,
            0.12471244484186172,
            0.08401976525783539,
            -0.041701242327690125,
            -0.7036796808242798,
            0.2110891342163086,
            -0.1753217577934265,
            -0.10595478117465973,
            0.2136210799217224,
            -0.07285050302743912,
            0.3567206561565399,
            0.17534594237804413,
            -0.15380388498306274,
            -0.11990868300199509,
            -0.05352381244301796,
            -0.6704946160316467,
            -0.27858206629753113,
            -0.6324244737625122,
            0.025223134085536003,
            0.04759073257446289,
            -0.13168251514434814,
            -0.4035433232784271,
            0.2031802535057068,
            0.4661034941673279,
            -0.34603509306907654,
            0.16587907075881958,
            0.013859004713594913,
            0.2029891163110733,
            0.1504310518503189,
            0.2797047197818756,
            0.059123408049345016,
            -0.5968689322471619,
            0.08598080277442932,
            0.1551150679588318
          ],
          [
            -0.04390270635485649,
            -0.3478972613811493,
            -0.22542014718055725,
            -0.06302854418754578,
            0.2177889496088028,
            0.452537477016449,
            0.16238650679588318,
            -0.31829848885536194,
            0.2198798954486847,
            0.17629419267177582,
            0.2848045527935028,
            0.2733875811100006,
            -0.07623787224292755,
            -0.6249498724937439,
            0.5821484327316284,
            0.06318996846675873,
            0.019743500277400017,
            0.16808798909187317,
            -0.11692517250776291,
            -0.025123754516243935,
            0.40337279438972473,
            -0.03397046774625778,
            0.5130937695503235,
            0.04285106062889099,
            0.2492988556623459,
            -0.0007816574070602655,
            0.28155994415283203,
            -0.026351062580943108,
            0.3218320906162262,
            -0.2620689868927002,
            -0.45003172755241394,
            -0.01090005598962307,
            -0.009128742851316929,
            0.3533291518688202,
            0.08583180606365204,
            -0.33681753277778625,
            -0.34376031160354614,
            -0.7412753105163574,
            -0.05201341584324837,
            0.3691834509372711,
            0.3372608423233032,
            -0.43564164638519287,
            0.015902526676654816,
            0.040733806788921356,
            0.10083595663309097,
            -0.293027400970459,
            -0.0009250262519344687,
            -0.2106071412563324,
            0.26531463861465454,
            0.1726861596107483,
            0.34886398911476135,
            -0.13704095780849457,
            0.05377018079161644,
            0.04873631149530411,
            0.3113192319869995,
            0.2893608510494232,
            -0.4009180963039398,
            0.17115384340286255,
            -0.13754130899906158,
            -0.218344584107399,
            -0.004858443979173899,
            -0.023995842784643173,
            -0.34194982051849365,
            -0.029643652960658073
          ],
          [
            0.14175809919834137,
            0.17323191463947296,
            -0.4486216902732849,
            -0.4412482678890228,
            -0.21953612565994263,
            -0.035436633974313736,
            0.07542681694030762,
            -0.1329977661371231,
            -0.027065161615610123,
            0.049372874200344086,
            -0.02234107255935669,
            -0.35755014419555664,
            -0.32558923959732056,
            0.1636587679386139,
            -0.24688637256622314,
            -0.44005799293518066,
            0.19401639699935913,
            -0.24877768754959106,
            0.16845722496509552,
            -0.45391836762428284,
            -0.06787800043821335,
            -0.49719542264938354,
            -0.2023109495639801,
            0.03984140604734421,
            0.20325425267219543,
            -0.13453008234500885,
            -0.08008411526679993,
            -0.6020187735557556,
            -0.07205414772033691,
            -0.15103882551193237,
            0.045107774436473846,
            -0.09853500872850418,
            -0.0436774417757988,
            0.24382799863815308,
            -0.04736698791384697,
            0.31393322348594666,
            -0.5300267338752747,
            -0.15287621319293976,
            -0.3367988169193268,
            0.1885392963886261,
            0.08916627615690231,
            -0.3764124810695648,
            0.09541023522615433,
            -0.01562551036477089,
            -0.388522207736969,
            -0.2894585132598877,
            -0.02949935756623745,
            -0.09945794194936752,
            0.3754059970378876,
            0.06581294536590576,
            -0.26495158672332764,
            -0.23923245072364807,
            -0.07541879266500473,
            -0.28212255239486694,
            -0.6170555949211121,
            -0.17811478674411774,
            -0.51959228515625,
            -0.4333451986312866,
            0.1745532751083374,
            -0.12037966400384903,
            -0.4766898453235626,
            -0.8386669754981995,
            -0.232644721865654,
            0.07409016788005829
          ],
          [
            -0.22712767124176025,
            0.30447033047676086,
            0.35843902826309204,
            -0.006739174015820026,
            -0.2517162561416626,
            -0.4535336196422577,
            0.023998886346817017,
            0.4654713273048401,
            -0.2910078465938568,
            -0.4926183521747589,
            -0.2725569009780884,
            -0.19095478951931,
            0.14923444390296936,
            0.17526116967201233,
            0.4936171770095825,
            -0.38813018798828125,
            0.13602794706821442,
            0.3118639588356018,
            -0.42892706394195557,
            0.28292617201805115,
            -0.39248642325401306,
            -0.1781652569770813,
            0.20640313625335693,
            -0.618776261806488,
            -0.3409896492958069,
            0.25024357438087463,
            -0.22967518866062164,
            -0.3990408182144165,
            -0.4735203683376312,
            0.12683220207691193,
            0.14501000940799713,
            0.3294084966182709,
            -0.22791598737239838,
            0.03252926468849182,
            0.17455466091632843,
            -0.17392297089099884,
            -0.317528635263443,
            -0.15087716281414032,
            -0.08431707322597504,
            -0.20022356510162354,
            -0.09863108396530151,
            -0.7124965190887451,
            0.06827695667743683,
            0.195861354470253,
            0.231003999710083,
            -0.18926630914211273,
            -0.3650154173374176,
            0.17254866659641266,
            0.16533009707927704,
            0.12800300121307373,
            -0.1469123214483261,
            -0.23433275520801544,
            -0.12574772536754608,
            0.5061273574829102,
            0.24448224902153015,
            -0.08988556265830994,
            0.016466831788420677,
            0.20275239646434784,
            0.30205991864204407,
            0.24640440940856934,
            -0.08473507314920425,
            -0.2752912938594818,
            -0.007021493278443813,
            -0.2754138708114624
          ],
          [
            0.5568438768386841,
            0.27171987295150757,
            -0.3392699658870697,
            0.24838514626026154,
            -0.08031808584928513,
            0.050036899745464325,
            -0.16615308821201324,
            -0.24867181479930878,
            -0.2742653787136078,
            0.3017503023147583,
            0.2048686444759369,
            -0.07686599344015121,
            -0.09109366685152054,
            -0.19741982221603394,
            -0.3033806383609772,
            -0.1835029423236847,
            0.15793821215629578,
            0.45497778058052063,
            -0.4543543756008148,
            -0.08898872137069702,
            0.22535555064678192,
            0.13016021251678467,
            -0.05227130651473999,
            -0.08934865146875381,
            -0.20552633702754974,
            -0.14621494710445404,
            -0.12949924170970917,
            -0.2949669361114502,
            0.5534628629684448,
            -0.17070315778255463,
            -0.10375884920358658,
            0.14239594340324402,
            -0.1764109879732132,
            0.20873858034610748,
            -0.08290564268827438,
            0.46422716975212097,
            0.21046802401542664,
            0.11807311326265335,
            -0.10442671924829483,
            -0.5562770962715149,
            0.20880454778671265,
            0.07267937809228897,
            -0.19788676500320435,
            0.039305321872234344,
            -0.41922348737716675,
            0.16734789311885834,
            -0.6703788042068481,
            -0.04050879925489426,
            0.2110183984041214,
            -0.2036445140838623,
            -0.054460760205984116,
            -0.12707050144672394,
            -0.4405609965324402,
            0.2695824205875397,
            0.241537943482399,
            0.030388887971639633,
            0.40373724699020386,
            0.1765153557062149,
            0.30101871490478516,
            0.36404603719711304,
            0.06229499354958534,
            -0.5125669240951538,
            -0.2098185122013092,
            0.1892930269241333
          ],
          [
            -0.07593917846679688,
            -0.0018754005432128906,
            0.19979846477508545,
            -0.2326224446296692,
            -0.03688782453536987,
            0.2158595323562622,
            -0.21513187885284424,
            0.14572906494140625,
            0.17352986335754395,
            -0.07261359691619873,
            -0.04589635133743286,
            0.18466466665267944,
            -0.15363240242004395,
            0.023705482482910156,
            0.04772132635116577,
            -0.017007768154144287,
            -0.04619431495666504,
            0.2045716643333435,
            0.08211290836334229,
            -0.052508533000946045,
            -0.14479577541351318,
            -0.19825148582458496,
            0.1624453067779541,
            0.0452730655670166,
            -0.09244745969772339,
            0.03413444757461548,
            0.07104068994522095,
            -0.11064338684082031,
            -0.1629757285118103,
            0.23869282007217407,
            0.15341156721115112,
            -0.20170152187347412,
            0.11799502372741699,
            0.18178725242614746,
            -0.03395169973373413,
            -0.14398694038391113,
            -0.03005141019821167,
            -0.1291840672492981,
            0.0027994513511657715,
            0.03855806589126587,
            0.04409134387969971,
            -0.19171088933944702,
            -0.22404789924621582,
            -0.16772735118865967,
            -0.13358992338180542,
            0.11541908979415894,
            0.00940406322479248,
            -0.07174623012542725,
            0.1874101161956787,
            -0.08752578496932983,
            -0.09820330142974854,
            -0.08684062957763672,
            0.1883612871170044,
            0.14305716753005981,
            0.22152483463287354,
            -0.15786004066467285,
            -0.16295838356018066,
            0.19211721420288086,
            -0.12146526575088501,
            -0.22966116666793823,
            -0.22610318660736084,
            0.045493364334106445,
            0.006043136119842529,
            0.24435418844223022
          ],
          [
            -0.12159261852502823,
            -0.2108640819787979,
            0.2369282990694046,
            -0.15261299908161163,
            -0.5529386401176453,
            -0.2197168916463852,
            0.2050488293170929,
            -0.3683325946331024,
            -0.16001230478286743,
            -0.23842193186283112,
            0.17117024958133698,
            0.0077477749437093735,
            -0.3842301070690155,
            0.27472105622291565,
            0.08838611841201782,
            -0.32309070229530334,
            -0.13222496211528778,
            -0.021925337612628937,
            -0.12221671640872955,
            0.009566334076225758,
            0.2385876625776291,
            -0.18492095172405243,
            -0.16466479003429413,
            0.022808071225881577,
            0.1743781864643097,
            0.07954023778438568,
            -0.43211865425109863,
            -0.02396899089217186,
            -0.03424389660358429,
            0.06133115664124489,
            -0.08066021651029587,
            0.3387269973754883,
            -0.4798678755760193,
            0.036056485027074814,
            0.10018863528966904,
            0.30039629340171814,
            -0.07435371726751328,
            -0.07880924642086029,
            -0.0522456094622612,
            0.028368746861815453,
            0.47513774037361145,
            -0.5198213458061218,
            0.08105388283729553,
            -0.3044953942298889,
            0.12498483061790466,
            0.24567052721977234,
            -0.017574038356542587,
            -0.2230907827615738,
            0.1614951342344284,
            0.07252627611160278,
            -0.1137794777750969,
            -0.07755698263645172,
            -0.45546168088912964,
            0.0994662493467331,
            0.1515200287103653,
            0.04648258909583092,
            -0.013836109079420567,
            0.18682420253753662,
            0.22014343738555908,
            0.009639681316912174,
            -0.44236505031585693,
            0.04579438641667366,
            0.2831529378890991,
            0.1783735156059265
          ],
          [
            -0.24631941318511963,
            0.3427734076976776,
            -0.1825857162475586,
            0.26266488432884216,
            -0.03273746371269226,
            -0.2363036721944809,
            -0.12525826692581177,
            -0.3458367586135864,
            0.23518133163452148,
            -0.03349772095680237,
            0.15026476979255676,
            -0.44030407071113586,
            -0.20689351856708527,
            -0.5595495700836182,
            -0.3046362102031708,
            -0.36982741951942444,
            0.12402749061584473,
            -0.060937222093343735,
            0.0005693997954949737,
            -0.12541529536247253,
            -0.3263929486274719,
            -0.1347493976354599,
            0.0637933686375618,
            -0.2219526767730713,
            0.2370469570159912,
            0.3350861668586731,
            -0.24404598772525787,
            -0.6285911202430725,
            -0.4080446660518646,
            -0.8534101247787476,
            0.0262040663510561,
            -0.34291234612464905,
            -0.3055633008480072,
            0.14359590411186218,
            -0.19293950498104095,
            -0.024626875296235085,
            -0.09614566713571548,
            -0.4941343069076538,
            -0.12316311150789261,
            -0.10740137845277786,
            0.09672278165817261,
            0.0772397518157959,
            0.025987762957811356,
            -0.3930160403251648,
            -0.3263208866119385,
            -0.8360179662704468,
            -0.39447271823883057,
            0.1479722261428833,
            -0.3263448476791382,
            -0.24992257356643677,
            -0.2846266031265259,
            -0.4408845603466034,
            0.019687583670020103,
            -0.5403898358345032,
            -0.12230141460895538,
            -0.5152667164802551,
            -0.10812637954950333,
            -0.38967975974082947,
            -0.4781638979911804,
            -0.20760376751422882,
            -0.2072698175907135,
            -0.30736812949180603,
            -0.15528585016727448,
            0.04086095094680786
          ],
          [
            0.03140028938651085,
            -0.42660531401634216,
            -0.7079266905784607,
            0.021033326163887978,
            0.3439478576183319,
            -0.7660669088363647,
            0.23836849629878998,
            -0.3696509897708893,
            -0.7235512137413025,
            0.054944999516010284,
            -0.041565392166376114,
            -0.4944888651371002,
            0.40064170956611633,
            0.23033547401428223,
            -0.16848182678222656,
            0.27081677317619324,
            0.21497271955013275,
            0.018503224477171898,
            -0.04358964413404465,
            -0.15725716948509216,
            0.17852824926376343,
            0.04068189486861229,
            -0.058546602725982666,
            -0.09756001085042953,
            0.11023973673582077,
            0.3276747167110443,
            -0.2942317724227905,
            0.07586224377155304,
            -0.22622600197792053,
            -0.5900004506111145,
            0.20659448206424713,
            -0.3831006586551666,
            -0.4254390001296997,
            0.21472741663455963,
            -0.07328170537948608,
            0.2622157037258148,
            0.13402549922466278,
            0.0027297278866171837,
            -0.13227802515029907,
            -0.32429447770118713,
            0.31767356395721436,
            0.17458829283714294,
            -0.03641587868332863,
            -0.516071617603302,
            -0.05949072539806366,
            0.14781029522418976,
            -0.34748101234436035,
            -0.16297021508216858,
            0.17239440977573395,
            0.181740403175354,
            -0.03254237771034241,
            0.0944916382431984,
            -0.06502510607242584,
            -0.020186545327305794,
            -0.688478946685791,
            -0.1658484786748886,
            -1.2051987648010254,
            -0.19546742737293243,
            0.06594341993331909,
            -0.21524851024150848,
            -0.32635727524757385,
            0.35652610659599304,
            0.0697711780667305,
            -0.6709184050559998
          ],
          [
            -0.31017065048217773,
            -0.032984621822834015,
            0.2871399521827698,
            -0.06478739529848099,
            -0.03194596245884895,
            0.351168692111969,
            -0.31494462490081787,
            0.24979901313781738,
            0.3926643133163452,
            0.08328339457511902,
            0.1077079176902771,
            0.10726981610059738,
            -0.07389594614505768,
            0.28619009256362915,
            -0.44205352663993835,
            0.16550269722938538,
            -0.007962791249155998,
            -0.017963841557502747,
            0.04882337898015976,
            0.026194598525762558,
            0.04278383404016495,
            -0.1178823933005333,
            0.24663953483104706,
            0.04115135222673416,
            0.24689975380897522,
            -0.45393338799476624,
            0.2886832356452942,
            -0.27013060450553894,
            -0.19792167842388153,
            -0.38990259170532227,
            -0.2143068015575409,
            0.01805344969034195,
            0.14029033482074738,
            0.03456313535571098,
            -0.390568345785141,
            -0.2793877124786377,
            0.24236315488815308,
            -0.0014943414134904742,
            0.06534786522388458,
            0.11937934160232544,
            0.10035374760627747,
            -0.4557987153530121,
            -0.021091997623443604,
            -0.23507405817508698,
            -0.4307251274585724,
            -0.04457413777709007,
            -0.07670260965824127,
            0.1448950469493866,
            -0.28393077850341797,
            -0.15873408317565918,
            0.0889090895652771,
            0.1568606197834015,
            0.33244067430496216,
            0.10107479244470596,
            0.28046470880508423,
            0.32505592703819275,
            0.3311421573162079,
            0.21542289853096008,
            -0.1595897525548935,
            0.27298635244369507,
            0.29453757405281067,
            -0.09017862379550934,
            0.29370182752609253,
            -0.041081491857767105
          ],
          [
            -0.24738581478595734,
            -0.010154767893254757,
            -0.119670569896698,
            -0.08331016451120377,
            -0.16224022209644318,
            0.022974688559770584,
            -0.2549082934856415,
            -0.18697203695774078,
            0.13222472369670868,
            -0.058953575789928436,
            -0.4639984965324402,
            0.20208902657032013,
            -0.0011172981467097998,
            0.14147131145000458,
            0.17752480506896973,
            -0.4247298538684845,
            0.14036381244659424,
            -0.4285650849342346,
            -0.14546328783035278,
            -0.4110821485519409,
            0.25483548641204834,
            0.2706115245819092,
            0.047078363597393036,
            -0.1891777664422989,
            0.24592424929141998,
            0.0322028286755085,
            0.0981682762503624,
            -0.08690695464611053,
            0.10099799931049347,
            -0.2222263067960739,
            -0.15296658873558044,
            -0.5700050592422485,
            -0.17444777488708496,
            0.10212782770395279,
            -0.23271708190441132,
            0.07241624593734741,
            -0.05822548642754555,
            0.2297137975692749,
            -0.3171166479587555,
            0.10599415749311447,
            0.04846469685435295,
            -0.0593072883784771,
            0.0716698169708252,
            -0.7232654094696045,
            -0.3330536484718323,
            -0.32127541303634644,
            -0.5494998693466187,
            -0.06790672987699509,
            -0.02205115742981434,
            -0.0961262583732605,
            -0.3739417791366577,
            -0.011503194458782673,
            -0.12631958723068237,
            0.07421613484621048,
            -0.2038845270872116,
            -0.5507197380065918,
            -0.25975149869918823,
            0.09142227470874786,
            0.13231973350048065,
            0.3527705669403076,
            -0.13086473941802979,
            -0.2819855511188507,
            -0.06243875250220299,
            0.350067675113678
          ],
          [
            0.39685750007629395,
            -0.3121252954006195,
            0.07717562466859818,
            -0.010194189846515656,
            -0.6262912154197693,
            0.1432945877313614,
            -0.5950977802276611,
            -0.010859772562980652,
            -0.20348303020000458,
            -0.2151341438293457,
            -0.0953979566693306,
            -0.0965222418308258,
            0.4331718385219574,
            0.000394379545468837,
            -0.16648443043231964,
            -0.17881552875041962,
            -0.4993038475513458,
            -0.33790451288223267,
            0.35981249809265137,
            -0.5028067231178284,
            -0.199436217546463,
            -0.2380426973104477,
            0.09491690248250961,
            -0.315128356218338,
            -0.30586671829223633,
            -0.22940173745155334,
            -0.19644372165203094,
            0.27707064151763916,
            0.006601711735129356,
            -0.3122060000896454,
            -0.14862266182899475,
            -0.13243503868579865,
            -0.024820076301693916,
            0.07346579432487488,
            -0.07693254202604294,
            0.2145778238773346,
            -0.04366369545459747,
            -0.6052079200744629,
            0.010202761739492416,
            -0.3159794211387634,
            -0.150929257273674,
            -0.09924802929162979,
            0.13225023448467255,
            -0.26824885606765747,
            -0.3362368047237396,
            -0.11655508726835251,
            0.2876385748386383,
            -0.17192962765693665,
            0.020222371444106102,
            0.11304223537445068,
            -0.5742770433425903,
            0.23119017481803894,
            -0.07699073106050491,
            0.000856929924339056,
            -0.11542224138975143,
            -0.1483713686466217,
            -0.230737566947937,
            -0.11139202117919922,
            -0.08361810445785522,
            -0.009354053996503353,
            -0.2818264663219452,
            0.09426286816596985,
            -0.26558855175971985,
            -0.35754454135894775
          ],
          [
            -0.14600716531276703,
            0.12636031210422516,
            -0.16666832566261292,
            -0.2712896168231964,
            -0.20146359503269196,
            0.02794472500681877,
            -0.21278205513954163,
            -0.22572284936904907,
            -0.34778210520744324,
            0.08182445168495178,
            -0.0663493201136589,
            -0.31699463725090027,
            -0.603396475315094,
            0.10861758887767792,
            0.24440151453018188,
            0.17777328193187714,
            -0.06297682970762253,
            0.1861274093389511,
            0.1580284982919693,
            -0.17685428261756897,
            -0.25427401065826416,
            0.22819800674915314,
            -0.022974949330091476,
            -0.28025975823402405,
            0.018959736451506615,
            -0.450516939163208,
            -0.26875370740890503,
            0.19389459490776062,
            0.16489866375923157,
            0.3347301483154297,
            0.12312078475952148,
            0.0039810738526284695,
            -0.2919624447822571,
            -0.08633387088775635,
            -0.0038913763128221035,
            0.04277592897415161,
            0.23684172332286835,
            -0.3070158064365387,
            0.006863500457257032,
            -0.054374221712350845,
            0.2839239835739136,
            0.10140518099069595,
            -0.10420039296150208,
            -0.25642597675323486,
            -0.22422054409980774,
            -0.11871255934238434,
            0.016802730038762093,
            -0.0724150612950325,
            -0.07093767821788788,
            -0.08642590045928955,
            -0.19856183230876923,
            -0.05626611411571503,
            0.006636412814259529,
            -0.15881507098674774,
            -0.024111922830343246,
            -0.29736217856407166,
            -0.010440327227115631,
            -0.07446157187223434,
            0.2335553765296936,
            0.05028856545686722,
            -0.18652372062206268,
            -0.34387364983558655,
            0.1121644675731659,
            -0.30241674184799194
          ],
          [
            0.190715491771698,
            0.002673625946044922,
            -0.05973905324935913,
            -0.07893288135528564,
            -0.1616167426109314,
            -0.10230499505996704,
            -0.24368011951446533,
            0.0798376202583313,
            0.03317958116531372,
            0.2432408332824707,
            0.12257713079452515,
            -0.0100860595703125,
            -0.10401368141174316,
            0.10005033016204834,
            0.08714210987091064,
            0.09399640560150146,
            0.034236133098602295,
            0.19585293531417847,
            0.013126552104949951,
            0.1737470030784607,
            -0.13507944345474243,
            -0.09193229675292969,
            0.11870700120925903,
            0.06042760610580444,
            -0.2208365797996521,
            -0.04118424654006958,
            0.12347221374511719,
            -0.1588679552078247,
            -0.2364654541015625,
            0.23757946491241455,
            -0.24356037378311157,
            -0.059762775897979736,
            -0.001385331153869629,
            -0.14065736532211304,
            -0.22281193733215332,
            0.1684478521347046,
            -0.20135444402694702,
            -0.08967757225036621,
            -0.11830282211303711,
            -0.1323070526123047,
            0.011266171932220459,
            -0.1169745922088623,
            -0.22844737768173218,
            -0.057777225971221924,
            0.13049650192260742,
            -0.14475929737091064,
            0.23913109302520752,
            -0.02194535732269287,
            -0.03490900993347168,
            0.21457916498184204,
            0.1096954345703125,
            -0.16688579320907593,
            -0.22321903705596924,
            0.09633797407150269,
            -0.19560706615447998,
            0.11727046966552734,
            0.20594632625579834,
            -0.20972150564193726,
            -0.18499517440795898,
            0.12783664464950562,
            -0.23902177810668945,
            0.204056978225708,
            -0.18254709243774414,
            0.24321717023849487
          ],
          [
            -0.16936364769935608,
            -0.0032671105582267046,
            -0.06504650413990021,
            0.04226727783679962,
            -0.5601088404655457,
            -0.012273779138922691,
            -0.4435228705406189,
            0.13766290247440338,
            -0.043877772986888885,
            0.08338294178247452,
            0.13469582796096802,
            -0.16340269148349762,
            -0.24925097823143005,
            -0.1819528490304947,
            0.017779648303985596,
            -0.7053818702697754,
            -0.47911709547042847,
            0.05091327801346779,
            -0.8753231763839722,
            -0.1463332325220108,
            -0.42366302013397217,
            0.13423144817352295,
            -0.29224616289138794,
            -0.026711301878094673,
            -0.0557224340736866,
            0.3547751307487488,
            -0.16111162304878235,
            0.14261914789676666,
            -0.2518470585346222,
            -0.35008424520492554,
            0.11599607765674591,
            -0.24791882932186127,
            -0.12438121438026428,
            0.0065767718479037285,
            -0.060027800500392914,
            -0.28823211789131165,
            -0.3346109688282013,
            -0.38847804069519043,
            -0.29014086723327637,
            -0.676569402217865,
            -0.21034489572048187,
            -0.43462684750556946,
            -0.18821030855178833,
            -0.006800378207117319,
            -0.39623934030532837,
            -0.2432212084531784,
            -0.03432105481624603,
            -0.12492026388645172,
            0.23242269456386566,
            0.12510067224502563,
            -0.10719133913516998,
            -0.05636985972523689,
            -0.14616119861602783,
            -0.024119820445775986,
            0.07119438052177429,
            -0.3333914577960968,
            0.009798352606594563,
            -0.1550401896238327,
            0.027163097634911537,
            0.22119355201721191,
            -0.02473684586584568,
            0.02243063412606716,
            -0.5798054337501526,
            -0.3594973385334015
          ],
          [
            0.14379076659679413,
            0.01892748288810253,
            0.15010765194892883,
            -0.13582877814769745,
            -0.4779861569404602,
            -0.0917765274643898,
            0.03693766891956329,
            0.15603575110435486,
            -0.4753147065639496,
            -0.060939617455005646,
            0.26641279458999634,
            0.12991736829280853,
            0.14602483808994293,
            -0.1731531172990799,
            -0.7388973236083984,
            -0.5332041382789612,
            0.29141613841056824,
            -0.7446712851524353,
            -0.24736879765987396,
            0.027563031762838364,
            -0.4960434138774872,
            0.11261429637670517,
            0.1955055147409439,
            -0.35307303071022034,
            0.7963637709617615,
            -0.34492257237434387,
            0.2208416759967804,
            0.11897395551204681,
            0.31150034070014954,
            -0.563301682472229,
            0.037899166345596313,
            -0.021524902433156967,
            0.15537692606449127,
            -0.43314269185066223,
            -0.6938921809196472,
            0.6584268808364868,
            -0.5634806752204895,
            0.18722207844257355,
            0.23606175184249878,
            -0.2855721712112427,
            0.11710350215435028,
            -0.07358485460281372,
            -0.06850791722536087,
            0.25423169136047363,
            -0.1273525208234787,
            -0.5005521774291992,
            0.5494707822799683,
            0.04276638105511665,
            -0.4028174877166748,
            -0.12266963720321655,
            -0.43158841133117676,
            0.24976593255996704,
            -0.8449952006340027,
            -0.5157719850540161,
            -0.05577605590224266,
            0.437237948179245,
            -0.367163747549057,
            0.46230337023735046,
            -0.401056170463562,
            0.3060919940471649,
            -0.2723017930984497,
            -0.3777328133583069,
            0.01988813653588295,
            -0.08833490312099457
          ],
          [
            -0.05684846639633179,
            -0.19297724962234497,
            0.28882405161857605,
            -0.33997148275375366,
            -0.4298632740974426,
            0.5636774301528931,
            -0.32978686690330505,
            -0.5279797315597534,
            0.0854920893907547,
            0.32479870319366455,
            0.22681725025177002,
            -0.40322089195251465,
            -0.870474636554718,
            -0.23898939788341522,
            -0.02422492392361164,
            -0.11349411308765411,
            0.20659738779067993,
            -0.43686118721961975,
            0.11976219713687897,
            0.00845036469399929,
            -0.4395153522491455,
            -0.21856160461902618,
            0.03934400901198387,
            0.0417310856282711,
            0.40215831995010376,
            -0.11553479731082916,
            0.3317944407463074,
            -0.31799620389938354,
            -0.0589444637298584,
            0.38158753514289856,
            -0.3482362627983093,
            -0.12821561098098755,
            0.2920563220977783,
            0.33734893798828125,
            -0.810930609703064,
            -0.2653067409992218,
            0.05234790965914726,
            0.2503712773323059,
            0.022560322657227516,
            0.05200521647930145,
            0.18151400983333588,
            -0.1231226697564125,
            0.047241609543561935,
            -0.5761489868164062,
            0.044120363891124725,
            -0.05364983156323433,
            0.021279392763972282,
            -0.2657167613506317,
            0.06297420710325241,
            -0.1019631028175354,
            0.3623294532299042,
            -0.1830333024263382,
            -0.4606707990169525,
            -0.37887921929359436,
            -0.00924151111394167,
            -0.21683290600776672,
            -0.03975982591509819,
            -0.15088695287704468,
            -0.20324817299842834,
            -0.3269585967063904,
            0.2101416289806366,
            -0.2360529899597168,
            0.061448074877262115,
            -0.495758056640625
          ],
          [
            -0.11707597970962524,
            0.07048758864402771,
            -0.19089657068252563,
            0.19411098957061768,
            -0.023188341408967972,
            -0.17111366987228394,
            -0.34744659066200256,
            -0.10760317742824554,
            -0.3307197093963623,
            0.06310431659221649,
            -0.24573686718940735,
            -0.10218310356140137,
            0.4238618314266205,
            -0.032335251569747925,
            -0.10136556625366211,
            0.12197928875684738,
            -0.3830418586730957,
            -0.2540723979473114,
            0.22787579894065857,
            -0.25369518995285034,
            0.49302995204925537,
            -0.5902656316757202,
            -0.26291412115097046,
            -0.4900248050689697,
            -0.08191201090812683,
            -0.4841856062412262,
            0.023265592753887177,
            -0.28700369596481323,
            -0.08260470628738403,
            -0.15693821012973785,
            -0.786431074142456,
            -0.2768690586090088,
            -0.314314603805542,
            -0.10497260838747025,
            -0.049590639770030975,
            0.08732158690690994,
            0.10059279948472977,
            0.2706705331802368,
            -0.2708119750022888,
            -0.5310636162757874,
            -0.5166520476341248,
            0.1253446787595749,
            0.02835572510957718,
            -0.11577536910772324,
            -0.5930955410003662,
            0.21435092389583588,
            0.23268261551856995,
            -0.13030502200126648,
            0.10587357729673386,
            -0.17748594284057617,
            -0.3743820786476135,
            0.2536585330963135,
            -0.2470090389251709,
            -5.700641486328095e-05,
            -0.046779368072748184,
            0.04964414983987808,
            -0.37154561281204224,
            0.12386014312505722,
            0.40276843309402466,
            0.1702260971069336,
            -0.17789427936077118,
            -0.09953626245260239,
            0.23967941105365753,
            -0.45779120922088623
          ],
          [
            -0.09891708195209503,
            -0.25979748368263245,
            -0.0659409761428833,
            0.0981132909655571,
            0.16088460385799408,
            0.05780557915568352,
            -0.6900782585144043,
            0.3407529592514038,
            -0.08153215050697327,
            -0.2186405509710312,
            0.1837361752986908,
            0.0948946550488472,
            0.17694661021232605,
            -0.015660656616091728,
            0.40831464529037476,
            -0.06060761585831642,
            0.496492862701416,
            0.3372384309768677,
            -0.15906308591365814,
            0.036359209567308426,
            -0.3788761496543884,
            -0.08154240995645523,
            -0.6453979015350342,
            -0.4913872182369232,
            0.08201001584529877,
            0.05416769161820412,
            -0.23442532122135162,
            -0.03845493122935295,
            0.14872726798057556,
            -0.007367449812591076,
            -0.12703247368335724,
            -0.07296410948038101,
            -0.06396795809268951,
            0.057814713567495346,
            -0.045279525220394135,
            0.02035803347826004,
            0.049912385642528534,
            0.13611146807670593,
            -0.1501110941171646,
            -0.27707698941230774,
            0.3041573762893677,
            0.02069254033267498,
            0.0198926143348217,
            0.1833302229642868,
            -0.3657629191875458,
            -0.08975838869810104,
            0.039969563484191895,
            -0.022153519093990326,
            0.012159885838627815,
            -0.12930619716644287,
            -0.18400229513645172,
            0.046085964888334274,
            0.15827268362045288,
            0.18312017619609833,
            0.025082696229219437,
            0.38018035888671875,
            0.06522157043218613,
            0.04701821506023407,
            -0.04311002045869827,
            0.0363183431327343,
            -0.2763310968875885,
            0.19410227239131927,
            0.001155032659880817,
            -0.1971353441476822
          ],
          [
            0.040274228900671005,
            -0.0821262001991272,
            -0.11548673361539841,
            -0.072564497590065,
            0.07611913233995438,
            -0.17707937955856323,
            -0.3597318232059479,
            0.19948160648345947,
            0.13314113020896912,
            0.03009505197405815,
            0.0989413931965828,
            0.11336194723844528,
            -0.48796817660331726,
            0.3236907422542572,
            0.0038864740636199713,
            0.027149256318807602,
            0.15882079303264618,
            0.026091761887073517,
            -0.303140252828598,
            -0.26641619205474854,
            0.2156863957643509,
            -0.04180902987718582,
            -0.41901177167892456,
            -0.31514373421669006,
            0.13195934891700745,
            0.16359980404376984,
            0.055788803845644,
            0.23452447354793549,
            -0.6445325016975403,
            -0.48822125792503357,
            -0.45413175225257874,
            -0.3770931363105774,
            -0.116846464574337,
            0.03649039566516876,
            -0.1078784167766571,
            0.12801092863082886,
            0.2201477289199829,
            -0.141052708029747,
            0.06504480540752411,
            0.16628922522068024,
            -0.06754553318023682,
            -0.16348937153816223,
