{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_7",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            32
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "dense_28_input"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_28",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "weights": [
          [
            -0.32192981243133545,
            0.08921706676483154,
            -0.24756328761577606,
            -0.1558857262134552,
            -0.14413084089756012,
            -0.004876826424151659,
            -0.38509026169776917,
            -0.13326218724250793,
            -0.23854480683803558,
            0.0003740417887456715,
            -0.05517345294356346,
            0.062056250870227814,
            -0.04066269472241402,
            -0.03360076621174812,
            -0.20094895362854004,
            0.08443115651607513,
            -0.03497759625315666,
            0.1279161125421524,
            -0.2656235694885254,
            0.16489005088806152,
            0.33953845500946045,
            0.27438443899154663,
            -0.32477113604545593,
            0.1798628270626068,
            -0.079911969602108,
            -0.1755884885787964,
            -0.010301221162080765,
            0.25019174814224243,
            0.09217125177383423,
            0.22264045476913452,
            -0.20276810228824615,
            0.10823485255241394,
            0.13296861946582794,
            0.11751002073287964,
            -0.15099062025547028,
            -0.06248639523983002,
            -0.066592276096344,
            -0.14266276359558105,
            -0.38678210973739624,
            0.09922085702419281,
            -0.0820281058549881,
            0.028989454731345177,
            0.15579545497894287,
            -0.22913798689842224,
            -0.07002078741788864,
            -0.20280510187149048,
            -0.12274988740682602,
            -0.17029035091400146,
            -0.02630963735282421,
            -0.3377107083797455,
            -0.2542668282985687,
            -0.2020270973443985,
            0.014780119061470032,
            -0.2280261367559433,
            0.05424231290817261,
            0.24959297478199005,
            0.06344616413116455,
            0.32850736379623413,
            -0.08291126787662506,
            -0.4004090130329132,
            -0.2137834131717682,
            -0.07468484342098236,
            -0.11177334934473038,
            0.03872673586010933
          ],
          [
            0.05113379657268524,
            0.24427340924739838,
            0.26264867186546326,
            0.18341128528118134,
            -0.3127290904521942,
            0.38664689660072327,
            -0.012107137590646744,
            0.27124786376953125,
            -0.019344571977853775,
            0.24027128517627716,
            -0.07315469533205032,
            0.5524091720581055,
            0.11873333156108856,
            0.38622328639030457,
            0.2596988379955292,
            0.5164364576339722,
            -0.2718377709388733,
            0.15637442469596863,
            0.3080993592739105,
            -0.6674349308013916,
            -0.16061294078826904,
            0.21864227950572968,
            0.11256899684667587,
            0.26307234168052673,
            -0.5324075818061829,
            -0.17947867512702942,
            0.45753374695777893,
            -0.010035783052444458,
            0.040985673666000366,
            -0.2106190323829651,
            -0.10405348986387253,
            0.18502378463745117,
            -0.22556141018867493,
            -0.3953251242637634,
            0.20705606043338776,
            0.012599457986652851,
            -0.19849665462970734,
            0.3607141375541687,
            0.5160608887672424,
            0.05474874749779701,
            0.21499070525169373,
            0.040178388357162476,
            -0.14102552831172943,
            0.19186116755008698,
            -0.33864733576774597,
            0.10826294869184494,
            0.15749019384384155,
            -0.5234655141830444,
            -0.020803410559892654,
            -0.0001953554165083915,
            -0.06651259958744049,
            0.37462201714515686,
            0.11983863264322281,
            -0.08380918204784393,
            0.18926434218883514,
            0.31197604537010193,
            -0.019670497626066208,
            0.15903429687023163,
            -0.11352615058422089,
            -0.24758853018283844,
            0.14464041590690613,
            -0.16589809954166412,
            0.1993342936038971,
            0.1572646051645279
          ],
          [
            -0.11776774376630783,
            -0.20340967178344727,
            0.19719691574573517,
            -0.049922384321689606,
            0.3179219663143158,
            0.060506369918584824,
            0.07957305014133453,
            -0.8509218692779541,
            0.003127831034362316,
            -0.04766198247671127,
            0.2626173794269562,
            0.0113895945250988,
            0.04492375627160072,
            0.03340955823659897,
            -0.15894976258277893,
            -0.12995752692222595,
            -0.812296450138092,
            0.18366466462612152,
            0.20009803771972656,
            -0.10580877959728241,
            0.1270911991596222,
            -0.15532246232032776,
            0.31386077404022217,
            -0.4380626976490021,
            0.057485222816467285,
            -0.0033068088814616203,
            -0.2694016098976135,
            0.07676836103200912,
            -0.06565513461828232,
            0.09487208724021912,
            -0.18244542181491852,
            0.13667306303977966,
            0.15350162982940674,
            -0.06893564015626907,
            -0.19469399750232697,
            0.32697629928588867,
            0.09181155264377594,
            -0.049419354647397995,
            -0.04634039103984833,
            -0.2821308970451355,
            -0.7337657809257507,
            0.2765718698501587,
            -0.08680900186300278,
            -0.4966391921043396,
            -0.2356766164302826,
            -0.2496640980243683,
            -0.13097161054611206,
            0.18466289341449738,
            -0.693943440914154,
            -0.1689455211162567,
            -0.06295979768037796,
            -0.5175971984863281,
            0.054006658494472504,
            0.3690226674079895,
            -0.43112292885780334,
            0.030431069433689117,
            -0.033680833876132965,
            -0.07641436159610748,
            0.08199864625930786,
            -0.08693651109933853,
            0.07273723185062408,
            -0.1061783879995346,
            -0.09513288736343384,
            -0.29905474185943604
          ],
          [
            -0.9845021367073059,
            0.0339122973382473,
            -0.15492390096187592,
            0.1343194842338562,
            0.026628665626049042,
            0.007423410192131996,
            -0.044938214123249054,
            0.12931235134601593,
            0.20670875906944275,
            0.07461319118738174,
            0.038631100207567215,
            0.014698746614158154,
            0.07761213183403015,
            0.044727783650159836,
            0.2948411703109741,
            -0.3341098129749298,
            -0.0275880116969347,
            0.05175008252263069,
            -0.3979613184928894,
            -0.3149847984313965,
            0.16818442940711975,
            0.03352362662553787,
            -0.3765045702457428,
            0.1373300999403,
            -0.5243390202522278,
            0.26957347989082336,
            0.2726985514163971,
            -0.4142548441886902,
            -0.056052904576063156,
            -0.2964591383934021,
            0.04632663354277611,
            0.21409620344638824,
            -0.303415447473526,
            0.4581431448459625,
            -0.07844510674476624,
            -0.17669115960597992,
            -0.252616822719574,
            -0.024196133017539978,
            -0.2794991433620453,
            0.11106803268194199,
            -0.03450799733400345,
            0.054237909615039825,
            0.09480823576450348,
            0.056840986013412476,
            0.173095241189003,
            -0.21071258187294006,
            -0.1618497520685196,
            -0.09228773415088654,
            -0.059688176959753036,
            0.06602995842695236,
            -0.09304630011320114,
            0.020918110385537148,
            -0.09752398729324341,
            0.14021484553813934,
            0.2827143669128418,
            -0.5000531077384949,
            0.014481166377663612,
            0.08181281387805939,
            -0.04985721781849861,
            -0.09960918128490448,
            -0.02245217002928257,
            0.049223653972148895,
            -0.13540594279766083,
            0.3941805958747864
          ],
          [
            -0.09763075411319733,
            -0.19355779886245728,
            0.09591050446033478,
            0.2506239116191864,
            -0.21128034591674805,
            0.15592041611671448,
            0.27403533458709717,
            -0.41873863339424133,
            0.0279935821890831,
            -0.2807998061180115,
            -0.22299110889434814,
            -0.024678334593772888,
            -0.0454794205725193,
            -0.009875179268419743,
            -0.17763887345790863,
            -0.03494204580783844,
            -0.03760862350463867,
            0.07365592569112778,
            -0.10326428711414337,
            -0.10603803396224976,
            0.0265742726624012,
            -0.01561843790113926,
            -0.0915747880935669,
            0.16515058279037476,
            0.2666824162006378,
            0.29883062839508057,
            0.11671489477157593,
            -0.2568803131580353,
            0.327027827501297,
            -0.01179968100041151,
            0.30517974495887756,
            -0.1532069593667984,
            0.470903605222702,
            -0.016722315922379494,
            0.06603725254535675,
            0.22896328568458557,
            0.009458276443183422,
            -0.29122793674468994,
            -0.16813598573207855,
            0.005069765727967024,
            -0.08768003433942795,
            -0.42791715264320374,
            -0.23897647857666016,
            0.2896047532558441,
            0.1904129981994629,
            -0.317062109708786,
            -0.39487141370773315,
            0.05781933292746544,
            -0.028403332456946373,
            -0.1361723244190216,
            -0.11847394704818726,
            0.20335663855075836,
            0.27798545360565186,
            -0.05781819671392441,
            -0.18742722272872925,
            -0.0725976750254631,
            0.05290406197309494,
            0.05053141340613365,
            0.9229199290275574,
            -0.1742500364780426,
            0.06625741720199585,
            -0.034731414169073105,
            0.30505436658859253,
            -0.3454376459121704
          ],
          [
            0.21465028822422028,
            -0.04336525872349739,
            -0.402306467294693,
            0.05199374258518219,
            0.15967623889446259,
            -0.19146078824996948,
            -0.146968275308609,
            -0.02208106592297554,
            0.1326264888048172,
            -0.174235999584198,
            -0.05634307861328125,
            -0.24804620444774628,
            -0.26835566759109497,
            -0.2707669734954834,
            0.02807156927883625,
            -0.0046822321601212025,
            -0.4406413435935974,
            0.026302052661776543,
            -0.008336439728736877,
            -0.42606648802757263,
            -0.4515434801578522,
            -0.35023337602615356,
            -0.20303338766098022,
            0.4985911548137665,
            -0.027700886130332947,
            0.09076140820980072,
            0.10877113044261932,
            -0.0643581748008728,
            -0.06921026110649109,
            -0.009940698742866516,
            -0.23684915900230408,
            0.16411253809928894,
            0.09466493874788284,
            0.05057825520634651,
            0.2940731346607208,
            0.001516685588285327,
            -0.003175164805725217,
            -0.7152999043464661,
            -0.5133137106895447,
            0.0238379817456007,
            0.1755320131778717,
            -0.09589505940675735,
            0.21665266156196594,
            -0.3318261504173279,
            -0.2928582727909088,
            0.023300131782889366,
            0.10661683231592178,
            -0.4537903070449829,
            -0.1315969079732895,
            -0.15500596165657043,
            0.062508724629879,
            0.11264076083898544,
            0.05933808162808418,
            -0.0318339504301548,
            -0.1995982527732849,
            -0.022501265630126,
            -0.2282513976097107,
            -0.7285849452018738,
            0.20585091412067413,
            0.5002566576004028,
            0.1748313158750534,
            0.019304532557725906,
            -0.11994493752717972,
            -0.36696645617485046
          ],
          [
            -0.234694242477417,
            -0.42092233896255493,
            0.07785197347402573,
            0.012755208648741245,
            0.23302830755710602,
            -0.27694937586784363,
            0.39533236622810364,
            -0.2290070652961731,
            0.07590474933385849,
            0.15473678708076477,
            -0.1106608584523201,
            -0.3872659206390381,
            -0.21221674978733063,
            -0.020787550136446953,
            0.15255360305309296,
            0.05798252671957016,
            -0.640925407409668,
            -0.4828038513660431,
            -0.2515450119972229,
            0.4059942662715912,
            0.06915077567100525,
            0.0013263633009046316,
            0.028988350182771683,
            0.08357362449169159,
            -0.2563091814517975,
            0.10760403424501419,
            -0.030763724818825722,
            0.2651642858982086,
            -0.10359110683202744,
            -0.0012911460362374783,
            -0.1545943170785904,
            -0.28780242800712585,
            -0.03182787075638771,
            0.08344333618879318,
            -0.384961873292923,
            0.19062922894954681,
            -0.5892537236213684,
            -0.12488376349210739,
            0.08901491016149521,
            0.24284043908119202,
            -0.498174786567688,
            0.11736075580120087,
            0.14874570071697235,
            0.07479607313871384,
            -0.1590321809053421,
            -0.6921499967575073,
            -0.2051447480916977,
            -0.09723640233278275,
            -0.008698812685906887,
            -0.03016294352710247,
            0.29297512769699097,
            -0.08490309119224548,
            0.20377691090106964,
            -0.08433666080236435,
            -0.06689205765724182,
            -0.23753312230110168,
            0.1211693286895752,
            -0.26641109585762024,
            0.25284498929977417,
            -0.1419227123260498,
            0.041002169251441956,
            -0.29676979780197144,
            0.3977080285549164,
            0.04564978927373886
          ],
          [
            0.4340284466743469,
            0.40370091795921326,
            0.3363417685031891,
            0.25850844383239746,
            0.32915690541267395,
            -0.0316302627325058,
            -0.25034624338150024,
            0.38998571038246155,
            -0.25959062576293945,
            -0.020830662921071053,
            0.3395051956176758,
            -0.007197357248514891,
            -0.017212092876434326,
            -0.22658301889896393,
            0.004023355431854725,
            0.44049715995788574,
            -0.24113729596138,
            -0.14479582011699677,
            -0.5810381770133972,
            -0.13051819801330566,
            -0.3049235939979553,
            -0.11001886427402496,
            -0.07126864790916443,
            -0.1417054384946823,
            -0.21094520390033722,
            0.5481436848640442,
            -0.35593387484550476,
            0.38027530908584595,
            0.4773785471916199,
            -0.21751268208026886,
            0.34837502241134644,
            -0.462972491979599,
            -0.05658689886331558,
            -0.34790587425231934,
            -0.01592561975121498,
            -0.04800458997488022,
            -0.07380123436450958,
            -0.055106524378061295,
            0.13069254159927368,
            0.048615578562021255,
            0.2471989542245865,
            -0.20015403628349304,
            0.19699722528457642,
            0.08056722581386566,
            0.41322067379951477,
            -0.16446459293365479,
            -0.00399858970195055,
            -0.3221321105957031,
            0.0824500024318695,
            0.1748897284269333,
            -0.3710079789161682,
            -0.958217442035675,
            0.17805571854114532,
            0.1373080611228943,
            -0.19318149983882904,
            0.14058849215507507,
            -0.007458748761564493,
            0.01893961802124977,
            0.07437221705913544,
            -0.5746329426765442,
            0.1762182116508484,
            -0.1239292174577713,
            -0.23509226739406586,
            -0.012772366404533386
          ],
          [
            -0.2215409278869629,
            0.18018680810928345,
            -0.1269271969795227,
            0.0946994423866272,
            0.13372135162353516,
            0.07448363304138184,
            0.03773123025894165,
            -0.10104602575302124,
            0.24978160858154297,
            0.24470394849777222,
            -0.2237899899482727,
            -0.016173124313354492,
            0.013557195663452148,
            -0.09915030002593994,
            -0.08744722604751587,
            -0.23895466327667236,
            -0.028370380401611328,
            -0.14968746900558472,
            -0.11785310506820679,
            0.1364905834197998,
            -0.24001914262771606,
            0.09823453426361084,
            -0.17032188177108765,
            0.07746744155883789,
            0.03988558053970337,
            -0.04827678203582764,
            0.051554977893829346,
            -0.233667254447937,
            0.10418760776519775,
            0.1353743076324463,
            0.1861196756362915,
            0.1720253825187683,
            0.00905078649520874,
            -0.01859140396118164,
            -0.15614908933639526,
            -0.1892191767692566,
            0.044258177280426025,
            0.052186429500579834,
            0.10602807998657227,
            -0.06023597717285156,
            0.13647788763046265,
            -0.23773837089538574,
            0.20689213275909424,
            0.03844934701919556,
            -0.17483234405517578,
            0.20328444242477417,
            0.13090276718139648,
            0.042264461517333984,
            -0.08619725704193115,
            0.23308008909225464,
            0.1295589804649353,
            0.14052844047546387,
            -0.15129238367080688,
            0.0683184266090393,
            0.06781876087188721,
            -0.2158498764038086,
            -0.1846981644630432,
            0.1360921859741211,
            0.1213635802268982,
            -0.055586934089660645,
            0.10503208637237549,
            -0.11313247680664062,
            0.1796911358833313,
            -0.0020492076873779297
          ],
          [
            0.010480344295501709,
            0.11750471591949463,
            0.09611082077026367,
            -0.14239883422851562,
            0.12715774774551392,
            -0.04662054777145386,
            0.1218947172164917,
            -0.1028711199760437,
            -0.07920652627944946,
            -0.044782161712646484,
            0.11464077234268188,
            -0.11524420976638794,
            -0.06946241855621338,
            -0.1476351022720337,
            0.061497628688812256,
            0.057215332984924316,
            -0.16558712720870972,
            0.009582757949829102,
            -0.08931905031204224,
            -0.12218773365020752,
            -0.07016193866729736,
            -0.19609785079956055,
            0.11401480436325073,
            -0.01583629846572876,
            0.07363396883010864,
            -0.2217237949371338,
            0.12000566720962524,
            0.21103495359420776,
            -0.07343918085098267,
            0.12229013442993164,
            0.10067909955978394,
            0.009145736694335938,
            0.03070056438446045,
            0.027301311492919922,
            0.17624878883361816,
            0.05135977268218994,
            -0.06558799743652344,
            -0.0625123381614685,
            -0.09335207939147949,
            0.03922027349472046,
            0.1903609037399292,
            -0.11260318756103516,
            -0.02909165620803833,
            0.2205328345298767,
            -0.07209891080856323,
            0.23249715566635132,
            -0.1942976713180542,
            0.07096272706985474,
            -0.1018141508102417,
            0.17873525619506836,
            -0.14968055486679077,
            -0.06489294767379761,
            -0.23166197538375854,
            -0.031295835971832275,
            0.22684502601623535,
            0.13588857650756836,
            -0.016711652278900146,
            0.05092900991439819,
            -0.04268258810043335,
            0.026285767555236816,
            -0.23916590213775635,
            0.11027586460113525,
            0.09247195720672607,
            0.1093435287475586
          ],
          [
            -0.059709131717681885,
            0.12380528450012207,
            0.1632530689239502,
            -0.12420374155044556,
            0.1488630771636963,
            0.023952186107635498,
            0.18191593885421753,
            -0.07638484239578247,
            -0.14423316717147827,
            0.24542200565338135,
            0.19613611698150635,
            0.03203165531158447,
            0.07492822408676147,
            -0.18508988618850708,
            -0.07707220315933228,
            -0.20365017652511597,
            0.20907741785049438,
            0.1092379093170166,
            0.22243374586105347,
            -0.15433043241500854,
            0.1250113844871521,
            -0.1262257695198059,
            0.17250847816467285,
            -0.004748046398162842,
            -0.2486557960510254,
            0.004376709461212158,
            0.0671955943107605,
            -0.01972275972366333,
            -0.05222433805465698,
            -0.23753482103347778,
            -0.19607317447662354,
            -0.17705827951431274,
            0.18126827478408813,
            0.22457635402679443,
            -0.1891149878501892,
            -0.18701815605163574,
            -0.22310954332351685,
            0.17189747095108032,
            -0.16488516330718994,
            -0.060050129890441895,
            0.1477489471435547,
            -0.11741799116134644,
            -0.21227043867111206,
            0.1975739598274231,
            -0.03511941432952881,
            0.048449933528900146,
            -0.11468863487243652,
            0.15992838144302368,
            -0.1258176565170288,
            0.185496985912323,
            0.2257063388824463,
            -0.23486703634262085,
            -0.09401530027389526,
            0.2221502661705017,
            -0.11263114213943481,
            -0.16263210773468018,
            -0.07657217979431152,
            -0.11715155839920044,
            -0.1067514419555664,
            -0.1785147786140442,
            0.10748088359832764,
            -0.15496182441711426,
            -0.1148415207862854,
            0.015243589878082275
          ],
          [
            0.3099692463874817,
            -0.0516195185482502,
            0.09772635251283646,
            0.20915593206882477,
            -0.4746554493904114,
            -0.0870550200343132,
            0.18674823641777039,
            -0.11496353149414062,
            -0.1579568237066269,
            0.13225121796131134,
            -0.49738675355911255,
            0.012075977399945259,
            -0.051150932908058167,
            -0.2484063059091568,
            0.1897556632757187,
            0.2881816625595093,
            -0.16240845620632172,
            -0.39054492115974426,
            0.09113460034132004,
            -0.25474217534065247,
            0.4684893786907196,
            0.22075827419757843,
            0.23508398234844208,
            0.1162026971578598,
            0.029670925810933113,
            -0.49406731128692627,
            -0.2713579833507538,
            -0.11883658915758133,
            -0.5993896722793579,
            0.27643460035324097,
            -0.18478678166866302,
            -0.0580664686858654,
            0.13436771929264069,
            0.009428536519408226,
            -0.20887577533721924,
            0.0451916866004467,
            0.22534623742103577,
            -0.12392787635326385,
            -0.30478858947753906,
            -0.016823383048176765,
            -0.2632371783256531,
            -0.09275088459253311,
            -0.10556810349225998,
            -0.1789281666278839,
            0.15245063602924347,
            -0.008453723043203354,
            -0.14335256814956665,
            -0.3849766254425049,
            -0.0946994498372078,
            0.13607946038246155,
            -0.320113867521286,
            -0.01860789768397808,
            -0.06183967366814613,
            -0.05272466689348221,
            -0.5253777503967285,
            -0.5030838847160339,
            -0.28183987736701965,
            -0.37685996294021606,
            -0.2854180335998535,
            0.27956676483154297,
            -0.34861230850219727,
            0.1328565776348114,
            0.15224023163318634,
            -0.09406917542219162
          ],
          [
            -0.4045795202255249,
            -0.2514685392379761,
            0.020153233781456947,
            -0.05518968030810356,
            -0.0022012596018612385,
            0.04893546923995018,
            -0.33147507905960083,
            -0.3265148997306824,
            -0.27006709575653076,
            0.09094534069299698,
            0.24268323183059692,
            -0.08998270332813263,
            0.05936918407678604,
            -0.09718017280101776,
            0.014357450418174267,
            -0.232697993516922,
            0.22038939595222473,
            -0.16656574606895447,
            -0.23724065721035004,
            -0.15344490110874176,
            0.024257902055978775,
            0.22060628235340118,
            -0.10493913292884827,
            -0.07923342287540436,
            0.19598068296909332,
            0.19764332473278046,
            -0.4221936762332916,
            -0.2368994802236557,
            -0.05401413515210152,
            -0.2532517611980438,
            0.039390359073877335,
            -0.309156596660614,
            0.14042343199253082,
            -0.11619699746370316,
            -0.2695925235748291,
            0.030266163870692253,
            -0.18096096813678741,
            0.10834585875272751,
            0.005903417244553566,
            -0.036425746977329254,
            -0.07972299307584763,
            0.008738911710679531,
            0.28266119956970215,
            -0.14234893023967743,
            0.2354217916727066,
            -0.06384952366352081,
            0.011813423596322536,
            0.025931019335985184,
            0.23051708936691284,
            -0.12425331026315689,
            -0.29406848549842834,
            -0.1841108500957489,
            -0.26482757925987244,
            0.12921656668186188,
            -0.24728530645370483,
            0.20108190178871155,
            0.048924967646598816,
            -0.08802297711372375,
            0.01057187095284462,
            -0.06201251223683357,
            -0.043258339166641235,
            -0.15844941139221191,
            -0.045608822256326675,
            0.08125880360603333
          ],
          [
            -0.5966783165931702,
            -0.2503005266189575,
            -0.10295179486274719,
            0.019685493782162666,
            -0.12775352597236633,
            -0.19713954627513885,
            -0.3914864659309387,
            0.2417113035917282,
            -0.3639495074748993,
            -0.19812937080860138,
            -0.08229696750640869,
            -0.14868953824043274,
            -0.36240440607070923,
            -0.5045105814933777,
            -0.2690611481666565,
            0.2577425241470337,
            -0.17881719768047333,
            -0.5301146507263184,
            0.3490079343318939,
            0.08204128593206406,
            -0.14577405154705048,
            0.06161167845129967,
            0.1372666358947754,
            0.21029485762119293,
            -0.3769536316394806,
            0.05060195550322533,
            0.01918645016849041,
            -0.10493076592683792,
            -0.10894652456045151,
            0.07565469294786453,
            0.1041460856795311,
            -0.4252264201641083,
            -0.15308131277561188,
            -0.20379634201526642,
            -0.467350035905838,
            -0.08320152759552002,
            -0.07694122940301895,
            0.4273339509963989,
            0.14658519625663757,
            -0.30734264850616455,
            -0.16090376675128937,
            0.35314226150512695,
            -0.37191009521484375,
            0.5045979022979736,
            -0.37754425406455994,
            0.4342494606971741,
            0.21798691153526306,
            -0.36814501881599426,
            -0.2949783504009247,
            -0.06121637672185898,
            0.07582415640354156,
            0.16695529222488403,
            -0.1386457085609436,
            -0.07067766785621643,
            0.2810359597206116,
            -0.2405538409948349,
            0.11493197083473206,
            -0.30096566677093506,
            -0.036267105489969254,
            -0.16360928118228912,
            -0.30245882272720337,
            -0.41131702065467834,
            0.24759896099567413,
            0.29641228914260864
          ],
          [
            0.08542955666780472,
            -0.07774205505847931,
            -0.06235343590378761,
            -0.13589021563529968,
            0.05627960339188576,
            -0.4906519949436188,
            -0.2982636094093323,
            -0.051074475049972534,
            0.10354995727539062,
            -0.16519655287265778,
            0.14575234055519104,
            -0.061749134212732315,
            -0.289625883102417,
            0.07332959771156311,
            0.2828535735607147,
            -0.458950400352478,
            0.12153661251068115,
            -0.13834401965141296,
            0.022283950820565224,
            -0.2225443422794342,
            -0.11395752429962158,
            0.07122164964675903,
            -0.15363435447216034,
            0.3844545781612396,
            -0.22817648947238922,
            -0.01357327401638031,
            0.07155878841876984,
            -0.09655040502548218,
            -0.1107095256447792,
            0.08186168968677521,
            -0.09256090968847275,
            0.015682438388466835,
            0.012357993051409721,
            0.018140632659196854,
            0.08542604744434357,
            0.08785565942525864,
            0.08702678978443146,
            -0.17598989605903625,
            0.018586840480566025,
            -0.20113548636436462,
            -0.026601269841194153,
            -0.09634168446063995,
            -0.01611192896962166,
            -0.3766593337059021,
            0.366317480802536,
            -0.10971888154745102,
            -0.2867608070373535,
            0.3817753791809082,
            -0.36605677008628845,
            -0.02896323800086975,
            -0.09783834964036942,
            -0.28841036558151245,
            -0.23033715784549713,
            0.047784700989723206,
            -0.10028563439846039,
            0.38400334119796753,
            -0.045135434716939926,
            -0.2063557505607605,
            0.02946542017161846,
            -0.07266422361135483,
            -0.035439468920230865,
            -0.12832613289356232,
            0.25589704513549805,
            -0.0670316070318222
          ],
          [
            0.03290770202875137,
            -0.008116901852190495,
            -0.8216100335121155,
            0.09192809462547302,
            0.2599058151245117,
            0.3613659739494324,
            0.6630069017410278,
            -0.24224981665611267,
            0.12055686116218567,
            0.016058988869190216,
            -0.31090280413627625,
            -0.22209031879901886,
            -0.6115825176239014,
            -0.060499291867017746,
            0.3444068133831024,
            0.380269855260849,
            0.17084616422653198,
            0.1590425819158554,
            -0.27306410670280457,
            -0.10007428377866745,
            -0.12588073313236237,
            0.024679820984601974,
            -0.21597854793071747,
            -0.24455294013023376,
            -0.07062181830406189,
            -0.4616158604621887,
            0.3331781029701233,
            -2.5495406589470804e-05,
            -0.08322278410196304,
            -0.3320298492908478,
            -0.21674026548862457,
            0.14750701189041138,
            0.08059293776750565,
            -0.04464277625083923,
            0.16318482160568237,
            0.3141953647136688,
            -0.026537759229540825,
            -0.29466870427131653,
            0.20310956239700317,
            -0.22484824061393738,
            0.31704646348953247,
            -0.01111062802374363,
            -0.18732097744941711,
            0.4568171203136444,
            0.3744554817676544,
            -0.6555652618408203,
            -0.21855998039245605,
            0.01914239674806595,
            0.06838850677013397,
            0.4415440261363983,
            0.25895029306411743,
            -0.1333235651254654,
            0.06237145513296127,
            0.04677211493253708,
            0.3970361053943634,
            0.004373698960989714,
            0.15961049497127533,
            0.35167792439460754,
            -0.33150672912597656,
            -0.055634573101997375,
            0.23492123186588287,
            -0.10406722128391266,
            -0.31130146980285645,
            -0.09592173993587494
          ],
          [
            0.013034575618803501,
            0.2927890419960022,
            -0.18057097494602203,
            -0.010457303375005722,
            -0.06217453256249428,
            0.38558340072631836,
            0.18835236132144928,
            -0.009070037864148617,
            -0.11847271025180817,
            -0.4669652283191681,
            0.37390732765197754,
            0.2612162232398987,
            -0.04388611763715744,
            0.3145711123943329,
            -0.4448416829109192,
            -0.11898477375507355,
            0.005775835365056992,
            -0.3236020803451538,
            0.24060671031475067,
            -0.19446323812007904,
            -0.16007663309574127,
            -0.17982184886932373,
            0.3427201211452484,
            0.15904247760772705,
            -0.18025636672973633,
            -0.32617685198783875,
            -0.46151766180992126,
            0.11902745068073273,
            0.36708948016166687,
            0.024210434406995773,
            0.2748786509037018,
            0.019945356994867325,
            -0.17166346311569214,
            -0.5979405641555786,
            -0.016726523637771606,
            -0.714583158493042,
            0.319364458322525,
            0.23919406533241272,
            0.4053349196910858,
            -0.39219921827316284,
            -0.3249724209308624,
            -0.0016055229352787137,
            -0.09312138706445694,
            0.49733051657676697,
            -0.12423013895750046,
            0.2524600625038147,
            0.3173222243785858,
            0.23204876482486725,
            0.14188306033611298,
            -0.47611120343208313,
            0.23553559184074402,
            0.09401532262563705,
            0.07731206715106964,
            -0.2637823224067688,
            -0.1146678626537323,
            -0.005313771776854992,
            0.1866346001625061,
            -0.24094796180725098,
            -0.07427698373794556,
            -0.01832590065896511,
            0.1599656194448471,
            -0.1461704820394516,
            0.11079298704862595,
            0.09176988899707794
          ],
          [
            -0.043042585253715515,
            0.13979347050189972,
            -0.4865298867225647,
            0.07605381309986115,
            -0.16174960136413574,
            0.05759526416659355,
            0.05709110572934151,
            0.07192683219909668,
            -0.07528876513242722,
            -0.1505248099565506,
            -0.06998030096292496,
            -0.1674426794052124,
            -0.009598496370017529,
            -0.2194664180278778,
            0.11284215748310089,
            -0.06189696863293648,
            -0.2412777990102768,
            0.08751394599676132,
            0.11557122319936752,
            0.050968483090400696,
            -0.36432746052742004,
            -0.47942644357681274,
            -0.07956124097108841,
            0.09520573168992996,
            -0.07117853313684464,
            -0.02520214207470417,
            -0.23611986637115479,
            -0.7549509406089783,
            -0.22824391722679138,
            -0.3349606394767761,
            -0.35062772035598755,
            -0.09454260021448135,
            -0.1973789632320404,
            0.37218016386032104,
            -0.047188736498355865,
            -0.3514712154865265,
            0.15546324849128723,
            -0.15350547432899475,
            0.22926907241344452,
            0.030566882342100143,
            -0.30787789821624756,
            -0.09805743396282196,
            0.09885365515947342,
            0.1757691353559494,
            0.2520335912704468,
            0.24765847623348236,
            0.09402970224618912,
            -0.07722529768943787,
            -0.0003726263530552387,
            0.20485183596611023,
            -0.16723832488059998,
            0.10243834555149078,
            0.18942119181156158,
            -0.0955301895737648,
            -0.08491656929254532,
            -0.10093297809362411,
            0.38424503803253174,
            -0.3668425679206848,
            -0.6139534711837769,
            0.07838020473718643,
            0.31929993629455566,
            -0.32310211658477783,
            -0.0939529538154602,
            0.004782205913215876
          ],
          [
            0.2140173763036728,
            0.2782081663608551,
            0.5165259838104248,
            -0.23121878504753113,
            -0.3407866656780243,
            -0.04186875745654106,
            -0.06457559764385223,
            0.31271597743034363,
            0.5328105688095093,
            -0.09961776435375214,
            -0.08821552991867065,
            0.1476999670267105,
            0.28187429904937744,
            0.3505841791629791,
            -0.3653290569782257,
            -0.08990971744060516,
            -0.4179539680480957,
            -0.2485784888267517,
            0.18566805124282837,
            -0.3734031021595001,
            -0.03908168524503708,
            -0.054781969636678696,
            0.042238928377628326,
            -0.19092604517936707,
            0.4423275291919708,
            0.1740560531616211,
            -0.05433844402432442,
            0.09284818172454834,
            -0.2872450053691864,
            -0.45643630623817444,
            0.31694746017456055,
            0.3791360557079315,
            -0.27555811405181885,
            0.020619764924049377,
            0.49142882227897644,
            -0.05087590590119362,
            -0.22430089116096497,
            0.04756046459078789,
            -0.021701926365494728,
            -0.38555455207824707,
            -0.23713475465774536,
            -0.19070902466773987,
            -0.17973001301288605,
            -0.3541862666606903,
            0.12876971065998077,
            -0.27998098731040955,
            0.17183637619018555,
            -0.09802646934986115,
            -0.2082752138376236,
            0.044147342443466187,
            -0.24745969474315643,
            0.17382192611694336,
            -0.17521430552005768,
            0.2498849332332611,
            0.2631756365299225,
            -0.48185253143310547,
            0.0031428192742168903,
            -0.14941339194774628,
            -0.27617552876472473,
            0.1967124193906784,
            0.000519380671903491,
            0.2328074425458908,
            0.5485605597496033,
            0.3957897126674652
          ],
          [
            0.3111129105091095,
            -0.25269752740859985,
            -0.3106524348258972,
            0.3722760081291199,
            0.4482297897338867,
            0.06757063418626785,
            0.3768251836299896,
            0.4900532066822052,
            -0.048727847635746,
            0.23738734424114227,
            0.11367037147283554,
            -0.7940217852592468,
            -0.3773134648799896,
            0.05525843799114227,
            -0.2910879850387573,
            -0.12995654344558716,
            -0.13066275417804718,
            -0.2562275826931,
            0.12910310924053192,
            0.18499253690242767,
            -0.11499099433422089,
            -0.40357041358947754,
            0.5020195841789246,
            -0.3722337484359741,
            -0.05546414107084274,
            -0.399478018283844,
            -0.033680349588394165,
            -0.0626775473356247,
            0.4151056408882141,
            -0.1386551558971405,
            0.04894077777862549,
            0.25758734345436096,
            0.03642629086971283,
            -0.4438853859901428,
            0.25485101342201233,
            -0.024463657289743423,
            0.15074267983436584,
            0.1103014126420021,
            0.2872842252254486,
            -0.03582870215177536,
            0.252932071685791,
            0.07539545744657516,
            0.07161648571491241,
            0.2333579659461975,
            0.16824747622013092,
            -0.16174179315567017,
            -0.20786800980567932,
            -0.2041376531124115,
            0.16588622331619263,
            -0.3061082363128662,
            0.15467415750026703,
            -0.12096948176622391,
            -0.25013041496276855,
            0.06486625224351883,
            0.02416522428393364,
            -0.12676383554935455,
            0.2508915960788727,
            -0.03430040180683136,
            0.34461188316345215,
            0.0833708643913269,
            0.0023940843529999256,
            0.13139519095420837,
            -0.2599278688430786,
            -0.06679833680391312
          ],
          [
            0.24847279489040375,
            0.004256130661815405,
            0.1739250123500824,
            0.12957999110221863,
            -0.2476547360420227,
            0.11360623687505722,
            -0.5510971546173096,
            -0.1950741708278656,
            0.15302860736846924,
            -0.18190757930278778,
            -0.0715550035238266,
            -0.45197105407714844,
            -0.16499167680740356,
            0.12653274834156036,
            0.23965342342853546,
            -0.34733107686042786,
            0.1967225819826126,
            0.014949597418308258,
            -0.006169434636831284,
            -0.5074201226234436,
            -0.1421869844198227,
            -0.356507807970047,
            0.15164829790592194,
            -0.36493587493896484,
            0.03957754746079445,
            -0.3284182548522949,
            0.03976979851722717,
            -0.3209051191806793,
            -0.12540727853775024,
            -0.28916576504707336,
            -0.20397330820560455,
            0.13372278213500977,
            0.08249402046203613,
            -0.15428704023361206,
            0.16229647397994995,
            0.010489196516573429,
            0.1764414757490158,
            -0.17007224261760712,
            -0.19408847391605377,
            0.1921781599521637,
            -0.5696496367454529,
            0.1234067901968956,
            -0.13162527978420258,
            0.07206808775663376,
            -0.336444228887558,
            -0.16367968916893005,
            0.10309585928916931,
            0.2913212180137634,
            -0.35738447308540344,
            0.31265050172805786,
            0.030152535066008568,
            -0.159934863448143,
            0.02757936157286167,
            -0.20058710873126984,
            0.20908653736114502,
            -0.09539838135242462,
            0.18478374183177948,
            -0.42771223187446594,
            0.10784655809402466,
            0.5157938003540039,
            -0.12938666343688965,
            0.42330047488212585,
            -0.33947432041168213,
            0.0035535437054932117
          ],
          [
            -0.10052838921546936,
            -0.048477236181497574,
            0.010963543318212032,
            -0.04372813552618027,
            -0.23396867513656616,
            -0.3102514147758484,
            0.19394029676914215,
            -0.02959636226296425,
            0.22957080602645874,
            0.16593068838119507,
            -0.5065608024597168,
            0.25202494859695435,
            0.04102599248290062,
            -0.04753977432847023,
            0.12156917154788971,
            -0.3780275583267212,
            0.0805351734161377,
            0.14333434402942657,
            -0.16041705012321472,
            0.17259445786476135,
            0.016976051032543182,
            0.013440050184726715,
            -0.04510202258825302,
            -0.002613436197862029,
            0.11376126110553741,
            -0.12266067415475845,
            0.35445940494537354,
            0.24131585657596588,
            -0.39281705021858215,
            -0.47992801666259766,
            0.13122443854808807,
            0.022186925634741783,
            0.04813029244542122,
            -0.18593981862068176,
            0.227779358625412,
            0.3597034215927124,
            0.19165191054344177,
            0.24615702033042908,
            0.017672959715127945,
            0.10629171133041382,
            0.06649523228406906,
            0.4094792902469635,
            -0.37310171127319336,
            -0.18680964410305023,
            -0.19002783298492432,
            -0.01999860815703869,
            0.5338047742843628,
            -0.005377954337745905,
            -0.17131289839744568,
            -0.01846756413578987,
            -0.55860435962677,
            0.03881978243589401,
            -0.09892676025629044,
            -0.21240511536598206,
            -0.05644756183028221,
            -0.23552753031253815,
            -0.03172976151108742,
            -0.4450918734073639,
            0.266561895608902,
            -0.2980524003505707,
            0.08745504170656204,
            -0.02055300958454609,
            -0.8045142292976379,
            -0.1661970615386963
          ],
          [
            0.18185436725616455,
            -0.08344703912734985,
            0.40192168951034546,
            0.09519544243812561,
            0.10853955894708633,
            -0.10011114180088043,
            0.12044163048267365,
            0.2092505544424057,
            0.18118414282798767,
            0.09585648030042648,
            0.10086056590080261,
            -0.15435382723808289,
            0.14806607365608215,
            -0.010648690164089203,
            -0.17811012268066406,
            -0.42733991146087646,
            0.11130299419164658,
            0.21229922771453857,
            0.049583956599235535,
            0.3865029811859131,
            -0.22896389663219452,
            -0.05300573632121086,
            0.17949219048023224,
            -0.3635636568069458,
            0.17383094131946564,
            -0.30294331908226013,
            -0.03910354524850845,
            -0.8979719877243042,
            -0.5020794868469238,
            0.31254786252975464,
            0.22377774119377136,
            -0.044810935854911804,
            0.03723829239606857,
            -0.42985567450523376,
            -0.08619725704193115,
            -0.22341373562812805,
            -0.5211324095726013,
            -0.22892318665981293,
            0.004370911978185177,
            -0.24563901126384735,
            0.03246593475341797,
            0.10904286801815033,
