{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_6",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            32
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "dense_24_input"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_24",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "weights": [
          [
            -0.23134948313236237,
            -0.24525086581707,
            0.14147038757801056,
            0.16270224750041962,
            -0.07790303975343704,
            0.13254861533641815,
            0.02788463979959488,
            0.09859854727983475,
            0.1470302790403366,
            -0.28483977913856506,
            0.27685484290122986,
            -0.12094374001026154,
            -0.05898510664701462,
            0.2804018259048462,
            0.43021342158317566,
            -0.2691366672515869,
            -0.17979887127876282,
            0.02513510175049305,
            0.07916044443845749,
            0.06100359559059143,
            0.0975876972079277,
            -0.11112186312675476,
            -0.021752305328845978,
            -0.192835733294487,
            -0.2675081491470337,
            0.33108678460121155,
            0.21507975459098816,
            -0.44212764501571655,
            -0.1368085891008377,
            -0.23987548053264618,
            0.15412308275699615,
            -0.23884396255016327,
            -0.00913516990840435,
            0.019516417756676674,
            0.07308126240968704,
            0.2648114562034607,
            -0.2580314576625824,
            -0.246698796749115,
            0.01750899851322174,
            0.04622653126716614,
            -0.14937685430049896,
            -0.09920357912778854,
            -0.19324111938476562,
            0.07378502935171127,
            0.294961154460907,
            -0.07350099086761475,
            0.03651056066155434,
            0.1969577521085739,
            -0.45501309633255005,
            -0.31823521852493286,
            0.30556344985961914,
            -0.15739969909191132,
            0.08612751960754395,
            0.06243053078651428,
            -0.0383404903113842,
            -0.13549888134002686,
            -0.2493012249469757,
            0.19649693369865417,
            -0.23354534804821014,
            -0.07887804508209229,
            -0.08729733526706696,
            0.09768258035182953,
            0.0814259722828865,
            0.1554255485534668
          ],
          [
            0.29929906129837036,
            0.19766730070114136,
            0.07793837785720825,
            -0.3193760812282562,
            -0.1510818898677826,
            -0.27205637097358704,
            -0.19946622848510742,
            0.20268435776233673,
            -0.21963612735271454,
            -0.039976295083761215,
            0.07525615394115448,
            0.10338147729635239,
            -0.12001994997262955,
            -0.03272401541471481,
            0.4812924265861511,
            0.4011782705783844,
            0.018904870375990868,
            -0.28314265608787537,
            -0.19539491832256317,
            -0.15588781237602234,
            -0.15936912596225739,
            0.017061516642570496,
            0.3705931603908539,
            -0.1574554592370987,
            0.15562628209590912,
            -0.021926874294877052,
            -0.1950245201587677,
            0.610353946685791,
            0.05658402666449547,
            0.2026577591896057,
            0.21658502519130707,
            0.002889009891077876,
            0.4185234606266022,
            0.20725731551647186,
            -0.309834748506546,
            0.12301412969827652,
            -0.31108421087265015,
            0.17652706801891327,
            -0.07424969226121902,
            0.37398406863212585,
            -0.04589064419269562,
            0.09032701700925827,
            -0.620622992515564,
            0.19056366384029388,
            0.12173082679510117,
            0.3059006333351135,
            0.18487118184566498,
            0.2632123827934265,
            0.5044593214988708,
            0.17140908539295197,
            0.0933704599738121,
            0.10983392596244812,
            0.35043221712112427,
            -0.3004341423511505,
            0.16623231768608093,
            -0.01610955409705639,
            0.33479365706443787,
            0.03183337301015854,
            -0.04388841241598129,
            0.04708631709218025,
            0.10638745874166489,
            -0.35830745100975037,
            0.4868723750114441,
            -0.37270814180374146
          ],
          [
            -0.22533124685287476,
            0.026437392458319664,
            0.021045763045549393,
            -0.22060523927211761,
            0.08325338363647461,
            -0.029803365468978882,
            -0.0999428778886795,
            -0.19394966959953308,
            -0.1511402130126953,
            -0.34884241223335266,
            0.033099666237831116,
            -0.4621415436267853,
            -0.10978534072637558,
            -0.568111002445221,
            0.002235760912299156,
            -0.17668761312961578,
            -0.6420785188674927,
            0.13810576498508453,
            -0.2561453580856323,
            -0.2600286602973938,
            -0.027227766811847687,
            -0.5218960642814636,
            0.007915761321783066,
            0.36147627234458923,
            0.14313587546348572,
            0.18815141916275024,
            0.0008678724407218397,
            -0.03618510067462921,
            -0.5356318950653076,
            -0.34617334604263306,
            -0.6602615714073181,
            0.08098691701889038,
            -0.4508565068244934,
            -0.44082361459732056,
            -0.05611204355955124,
            0.037236135452985764,
            -0.27397337555885315,
            -0.09260294586420059,
            0.003843871643766761,
            -0.060169804841279984,
            0.18229275941848755,
            0.3121308982372284,
            -0.4746612012386322,
            -0.49387383460998535,
            -0.032893043011426926,
            0.29431214928627014,
            -0.20669053494930267,
            0.0760265663266182,
            -0.3533959984779358,
            -0.00755543215200305,
            0.007439446169883013,
            -0.06987009197473526,
            -0.43949490785598755,
            -0.4267517328262329,
            0.08701302856206894,
            -0.024162789806723595,
            0.07864422351121902,
            0.02337050624191761,
            0.07077613472938538,
            -0.01917099952697754,
            -0.22871007025241852,
            0.08606790751218796,
            -0.008731500245630741,
            -0.41287559270858765
          ],
          [
            0.3604678511619568,
            -0.2523179352283478,
            -0.14001689851284027,
            -0.429299920797348,
            -0.1442374289035797,
            -0.14997756481170654,
            -0.14023371040821075,
            0.06306641548871994,
            -0.1588495671749115,
            0.17398788034915924,
            -0.43855220079421997,
            -0.10652508586645126,
            0.09428400546312332,
            0.07058769464492798,
            -0.1702270656824112,
            -0.5871039628982544,
            0.15208563208580017,
            -0.15892598032951355,
            0.24123167991638184,
            -0.03425736725330353,
            -0.08703812956809998,
            0.3564716577529907,
            0.09976892173290253,
            -0.2714211940765381,
            -0.10834227502346039,
            -0.31295692920684814,
            0.06419556587934494,
            -0.08748539537191391,
            0.2492334544658661,
            0.2166086882352829,
            -0.05620158836245537,
            -0.6860504150390625,
            -0.09349515289068222,
            0.3573189675807953,
            -0.07081261277198792,
            -0.46988818049430847,
            -0.20707720518112183,
            -0.26996278762817383,
            0.1460924595594406,
            -0.16509276628494263,
            0.3102038502693176,
            -0.2903187870979309,
            0.3807143270969391,
            0.010473514907062054,
            -0.3765871822834015,
            0.11933823674917221,
            0.124213308095932,
            0.013757254928350449,
            0.0008309814729727805,
            0.22442415356636047,
            -0.6382297873497009,
            -0.045527346432209015,
            -0.23370452225208282,
            -0.25744709372520447,
            0.17014943063259125,
            0.1894368827342987,
            -0.18755434453487396,
            0.3260721266269684,
            -0.15370051562786102,
            0.08039578050374985,
            -0.21723492443561554,
            0.34775295853614807,
            -0.18004952371120453,
            -0.16726131737232208
          ],
          [
            -0.7579028606414795,
            0.11471271514892578,
            0.023552387952804565,
            0.1867438703775406,
            0.0013022158527746797,
            0.08364928513765335,
            0.18452292680740356,
            0.22933238744735718,
            -0.19475995004177094,
            -0.9402080178260803,
            0.4838936924934387,
            0.3588913083076477,
            0.5244602560997009,
            0.44567668437957764,
            -0.27427437901496887,
            -0.6048238277435303,
            -0.02722066640853882,
            0.2841884195804596,
            0.3858298659324646,
            0.4247455894947052,
            0.588965654373169,
            0.4695598781108856,
            -0.17800670862197876,
            0.10643432289361954,
            0.4372740387916565,
            0.2630597949028015,
            0.10539442300796509,
            -0.41961777210235596,
            0.40621188282966614,
            0.7045695185661316,
            0.016553718596696854,
            -0.14646053314208984,
            0.35679665207862854,
            0.7228888869285583,
            -0.10938307642936707,
            0.1082979217171669,
            0.07003550231456757,
            -0.07939524203538895,
            0.23267053067684174,
            -0.16231989860534668,
            0.5724220275878906,
            -0.7517454624176025,
            -0.16663742065429688,
            0.014166636392474174,
            0.29313015937805176,
            -0.056084293872117996,
            -0.11060617864131927,
            0.25890955328941345,
            0.14000746607780457,
            0.7369457483291626,
            -0.13528352975845337,
            -0.16399937868118286,
            -0.2795470356941223,
            0.2554832100868225,
            0.03573089465498924,
            -0.28049105405807495,
            0.12528496980667114,
            0.2111690491437912,
            0.6671558618545532,
            0.3202594816684723,
            0.35794883966445923,
            -0.4428367614746094,
            0.43353939056396484,
            0.42293012142181396
          ],
          [
            -0.20143313705921173,
            -0.38168105483055115,
            -0.2136499434709549,
            -0.08084854483604431,
            -0.2757573425769806,
            -0.5537401437759399,
            -0.19870688021183014,
            -0.2501959502696991,
            0.11174608767032623,
            0.46828508377075195,
            0.060001276433467865,
            -0.2325167953968048,
            -0.16694572567939758,
            -0.20526430010795593,
            -0.005256203934550285,
            -0.36139827966690063,
            -0.3154482841491699,
            0.010565364733338356,
            -0.145280659198761,
            0.1599099487066269,
            -0.22954457998275757,
            0.1855056881904602,
            -0.20414666831493378,
            -0.3702108561992645,
            0.22915606200695038,
            -0.09531165659427643,
            -0.08699143677949905,
            0.1453932672739029,
            -0.25190532207489014,
            0.05504953861236572,
            -0.31697261333465576,
            0.333000510931015,
            0.014522664248943329,
            -0.22318723797798157,
            -0.04643433168530464,
            0.011280774138867855,
            -0.12673892080783844,
            0.3403565287590027,
            0.258306086063385,
            -0.2916143834590912,
            -0.3258437514305115,
            -0.6208946704864502,
            -0.22795923054218292,
            0.038273826241493225,
            -0.2645951211452484,
            0.10911313444375992,
            -0.06281697750091553,
            -0.3086593747138977,
            -0.20747028291225433,
            -0.19376514852046967,
            -0.17048922181129456,
            -0.17030496895313263,
            -0.2805863916873932,
            -0.08466072380542755,
            -0.2741095721721649,
            -0.12339195609092712,
            0.05383024364709854,
            -0.03034251742064953,
            -0.19083894789218903,
            0.23440155386924744,
            -0.0931839719414711,
            0.1523524522781372,
            -0.08095574378967285,
            -0.3431563675403595
          ],
          [
            -0.3785911202430725,
            0.42767131328582764,
            0.06602524220943451,
            0.2970852255821228,
            0.05360465869307518,
            -0.37853363156318665,
            -0.18492688238620758,
            0.2259419858455658,
            0.256394624710083,
            -0.24253042042255402,
            -0.06821497529745102,
            0.13265526294708252,
            -0.20733752846717834,
            0.21778807044029236,
            0.19262182712554932,
            -0.27321240305900574,
            0.0993555337190628,
            -0.07111304253339767,
            0.12998588383197784,
            -0.7230066061019897,
            0.12896513938903809,
            0.15062041580677032,
            -0.3976879417896271,
            0.13189882040023804,
            0.19611549377441406,
            -0.17313504219055176,
            -0.07628215104341507,
            -0.5139837861061096,
            -0.12414691597223282,
            0.3940551280975342,
            -0.32050418853759766,
            0.03619092330336571,
            -0.1492418646812439,
            -0.0900941863656044,
            0.09164144843816757,
            0.2647514045238495,
            -0.16145268082618713,
            0.2164541482925415,
            0.08713747560977936,
            -0.02556649036705494,
            0.23839102685451508,
            0.1737196296453476,
            -0.06170077994465828,
            -0.2735028862953186,
            -0.41324716806411743,
            -0.5149646997451782,
            0.31399816274642944,
            -0.19107092916965485,
            -0.07392740994691849,
            0.5332543849945068,
            0.09992241114377975,
            0.08267049491405487,
            -0.18167614936828613,
            -0.15874098241329193,
            -0.05410691350698471,
            -0.20141620934009552,
            0.12871092557907104,
            -0.5485271215438843,
            -0.009213489480316639,
            -0.24871410429477692,
            -0.019028618931770325,
            0.0821935310959816,
            0.06440914422273636,
            -0.5596904754638672
          ],
          [
            -0.014189326204359531,
            -0.18519218266010284,
            -0.11966542899608612,
            0.13376134634017944,
            -0.18687157332897186,
            -0.022725751623511314,
            0.0070926048792898655,
            -0.21681426465511322,
            0.25027334690093994,
            0.031890105456113815,
            0.0984421893954277,
            0.05436715483665466,
            0.2559144198894501,
            0.572287380695343,
            -0.23640115559101105,
            -0.10562792420387268,
            -0.766102135181427,
            0.2437921017408371,
            -0.4420031011104584,
            -0.29579514265060425,
            -0.14224407076835632,
            0.006077117752283812,
            0.12098857760429382,
            -0.18895089626312256,
            0.1858440339565277,
            0.14503751695156097,
            -0.3431878387928009,
            -0.044890452176332474,
            0.3319641649723053,
            0.00860082358121872,
            -0.15403583645820618,
            0.4478089213371277,
            0.07729890197515488,
            0.013563425280153751,
            0.20322231948375702,
            -0.04436781257390976,
            0.4521925747394562,
            -0.13943856954574585,
            0.3316754698753357,
            0.18115349113941193,
            -0.025903809815645218,
            0.4634315073490143,
            0.08660019189119339,
            -0.23252148926258087,
            0.09236631542444229,
            -0.24072422087192535,
            0.010036060586571693,
            0.3043445348739624,
            -0.09284565597772598,
            0.38505449891090393,
            -0.0426577553153038,
            -0.39238518476486206,
            0.012414935044944286,
            -0.09456361085176468,
            -0.27172887325286865,
            0.24033288657665253,
            0.25607988238334656,
            -0.33846724033355713,
            -0.06352750957012177,
            0.3350431025028229,
            0.4045946002006531,
            -0.3061809837818146,
            0.25066888332366943,
            0.4232136309146881
          ],
          [
            0.19560301303863525,
            0.08141487836837769,
            -0.2254505753517151,
            0.069766104221344,
            0.20062947273254395,
            0.011168897151947021,
            -0.08276015520095825,
            -0.2450026273727417,
            0.08364242315292358,
            0.09079504013061523,
            -0.010426878929138184,
            0.1453409194946289,
            0.09017503261566162,
            -0.018067240715026855,
            -0.17417675256729126,
            0.07500964403152466,
            -0.036521971225738525,
            0.07055026292800903,
            0.0027068257331848145,
            0.24715620279312134,
            0.07356441020965576,
            -0.09237247705459595,
            -0.016817152500152588,
            -0.03598862886428833,
            -0.07232004404067993,
            0.14085400104522705,
            -0.05471920967102051,
            0.1467248797416687,
            0.10458755493164062,
            0.0791274905204773,
            -0.10584968328475952,
            -0.18969285488128662,
            -0.02123844623565674,
            -0.050382912158966064,
            -0.2414238452911377,
            -0.06055343151092529,
            -0.05720365047454834,
            0.018449723720550537,
            -0.21514993906021118,
            0.07667756080627441,
            -0.20681297779083252,
            0.09192401170730591,
            -0.01539921760559082,
            -0.19953644275665283,
            0.18593591451644897,
            0.03465014696121216,
            -0.18449503183364868,
            0.04559004306793213,
            0.1243600845336914,
            0.11528855562210083,
            0.12662988901138306,
            -0.20927780866622925,
            -0.11624777317047119,
            0.22388070821762085,
            -0.04199165105819702,
            -0.2387292981147766,
            -0.032941579818725586,
            -0.09396249055862427,
            0.057424962520599365,
            0.17684227228164673,
            0.11700892448425293,
            0.04127514362335205,
            0.17804884910583496,
            0.06070554256439209
          ],
          [
            -0.1658231019973755,
            -0.23116111755371094,
            0.16019558906555176,
            -0.15717339515686035,
            -0.2152588963508606,
            -0.24483078718185425,
            0.07463717460632324,
            -0.07650476694107056,
            -0.14516353607177734,
            0.13816267251968384,
            -0.21915888786315918,
            0.2482413649559021,
            -0.1001124382019043,
            -0.2460184097290039,
            0.16279804706573486,
            -0.23818200826644897,
            0.22428345680236816,
            -0.12336820363998413,
            0.16468560695648193,
            0.2415897250175476,
            -0.16255271434783936,
            0.1396784782409668,
            -0.05256694555282593,
            0.016141533851623535,
            0.02717912197113037,
            -0.01867467164993286,
            0.01306217908859253,
            0.08775430917739868,
            0.056159794330596924,
            -0.09146887063980103,
            0.2284795641899109,
            0.039961159229278564,
            0.06005501747131348,
            0.17282354831695557,
            0.23851603269577026,
            0.19411969184875488,
            0.1321859359741211,
            0.22265368700027466,
            0.04765194654464722,
            0.004181802272796631,
            0.18942350149154663,
            -0.006323099136352539,
            -0.08644133806228638,
            -0.14573079347610474,
            0.11331158876419067,
            0.037541091442108154,
            -0.14551669359207153,
            -0.23509854078292847,
            0.14496451616287231,
            -0.019788086414337158,
            -0.2010698914527893,
            0.21330475807189941,
            0.04816395044326782,
            0.12042880058288574,
            0.21394872665405273,
            0.22973835468292236,
            0.0363810658454895,
            0.23869240283966064,
            0.10847151279449463,
            0.030528783798217773,
            -0.016195297241210938,
            0.22856968641281128,
            -0.046783626079559326,
            -0.0683286190032959
          ],
          [
            0.15196716785430908,
            0.13779091835021973,
            -0.08115583658218384,
            0.09902083873748779,
            0.2144981026649475,
            -0.24681878089904785,
            -0.13180828094482422,
            -0.17886000871658325,
            0.11691689491271973,
            0.05365866422653198,
            -0.016649305820465088,
            0.21180880069732666,
            0.1556406021118164,
            0.036069631576538086,
            0.0010707378387451172,
            0.09707725048065186,
            -0.1732933521270752,
            -0.23286032676696777,
            -0.03652995824813843,
            0.15352976322174072,
            -0.19581925868988037,
            0.22355663776397705,
            0.07708340883255005,
            -0.23314881324768066,
            0.10604333877563477,
            0.1943655014038086,
            -0.10314154624938965,
            -0.2196439504623413,
            -0.029637455940246582,
            0.09202015399932861,
            0.20715802907943726,
            0.031010568141937256,
            0.21206927299499512,
            -0.025993943214416504,
            -0.2072833776473999,
            0.15137070417404175,
            0.22621947526931763,
            -0.09833389520645142,
            -0.20857274532318115,
            -0.2209760546684265,
            -0.19332027435302734,
            -0.12941551208496094,
            -0.11576944589614868,
            0.14031130075454712,
            0.2158641815185547,
            -0.02934819459915161,
            0.011527538299560547,
            -0.06874686479568481,
            -0.0031648874282836914,
            0.06602245569229126,
            0.11238133907318115,
            -0.22169828414916992,
            -0.1644797921180725,
            -0.07017022371292114,
            0.2424336075782776,
            0.0530012845993042,
            0.10607630014419556,
            -0.24539226293563843,
            -0.11226356029510498,
            0.1183626651763916,
            -0.11819106340408325,
            0.22308355569839478,
            0.04890871047973633,
            0.19732624292373657
          ],
          [
            -0.14848335087299347,
            0.3850332200527191,
            -0.1830664575099945,
            -0.031831417232751846,
            -0.17223642766475677,
            0.42508840560913086,
            -0.16884849965572357,
            -0.08548693358898163,
            -0.3292390704154968,
            -0.07330235838890076,
            0.18443720042705536,
            0.31848350167274475,
            -0.12908262014389038,
            -0.4059520661830902,
            0.2363264113664627,
            -0.009403785690665245,
            -0.2672833800315857,
            0.20538091659545898,
            0.2715076804161072,
            -0.10966097563505173,
            0.16373999416828156,
            -0.19899457693099976,
            -0.4440098702907562,
            -0.29813075065612793,
            -0.335665225982666,
            0.23991908133029938,
            0.15675804018974304,
            -0.3632116913795471,
            0.238578200340271,
            0.1182800754904747,
            0.19848652184009552,
            -0.39540895819664,
            0.010635606944561005,
            -0.35505783557891846,
            -0.35570019483566284,
            0.14092865586280823,
            -0.2649109363555908,
            -0.3171096742153168,
            0.24249738454818726,
            -0.24895407259464264,
            -0.08101196587085724,
            0.1396578997373581,
            -0.22037018835544586,
            -0.5298215746879578,
            -0.1864621639251709,
            0.3187852203845978,
            0.02346743457019329,
            0.26566818356513977,
            -0.2027018964290619,
            0.3958485424518585,
            -0.21631330251693726,
            -0.12564460933208466,
            -0.24594679474830627,
            -0.1529194712638855,
            -0.209961399435997,
            -0.4659854471683502,
            0.0029116414953023195,
            -0.065203957259655,
            -0.5926868319511414,
            0.3304295837879181,
            -0.04843711107969284,
            0.09021653234958649,
            0.03254815936088562,
            -0.12136946618556976
          ],
          [
            -0.17184194922447205,
            -0.2547959089279175,
            -0.11067021638154984,
            -0.24519363045692444,
            0.00505788205191493,
            -0.3944864869117737,
            -0.06669692695140839,
            0.06266173720359802,
            -0.06872077286243439,
            -0.11229205131530762,
            -0.3901563286781311,
            0.06459461897611618,
            -0.18661601841449738,
            0.1502503603696823,
            -0.23601745069026947,
            0.12898528575897217,
            0.14379535615444183,
            0.16451296210289001,
            0.23308028280735016,
            -0.12782366573810577,
            0.05542047694325447,
            0.0384853258728981,
            0.0929676964879036,
            -0.04947967827320099,
            0.15103530883789062,
            -0.23878182470798492,
            -0.3149222731590271,
            -0.08116281777620316,
            0.17169751226902008,
            -0.033204566687345505,
            0.254330039024353,
            -0.16855156421661377,
            0.2338917851448059,
            0.22785185277462006,
            -0.1367105096578598,
            -0.09205376356840134,
            -0.5202103853225708,
            -0.1765964925289154,
            -0.058496154844760895,
            0.11713147908449173,
            0.1429136097431183,
            0.14992716908454895,
            -0.036849793046712875,
            -0.24664293229579926,
            0.09612181037664413,
            0.09438806027173996,
            -0.14056815207004547,
            -0.07758906483650208,
            0.10910892486572266,
            -0.3574162423610687,
            0.19543924927711487,
            0.014798371121287346,
            -0.4734970033168793,
            0.16605857014656067,
            -0.1802675724029541,
            -0.13823866844177246,
            -0.10414431989192963,
            -0.07690861821174622,
            0.22763343155384064,
            0.04620347172021866,
            0.024253053590655327,
            0.0369734987616539,
            0.0010667030001059175,
            -0.2438448667526245
          ],
          [
            -0.08497697114944458,
            0.09240970015525818,
            -0.025967704132199287,
            -0.4375780522823334,
            0.15951953828334808,
            0.3657846748828888,
            -0.1621679812669754,
            0.4122275710105896,
            0.4130569100379944,
            -0.26145774126052856,
            -0.023778434842824936,
            -0.3625909090042114,
            0.22470012307167053,
            0.31986895203590393,
            -0.34179630875587463,
            0.35551366209983826,
            0.292117178440094,
            -0.1582879275083542,
            -0.2716653347015381,
            -0.20766977965831757,
            0.046757929027080536,
            0.056095052510499954,
            -0.32010459899902344,
            0.44137996435165405,
            0.09863277524709702,
            0.11806634068489075,
            -0.084014393389225,
            0.24842727184295654,
            -0.0698583647608757,
            0.07607396692037582,
            -0.2120514065027237,
            -0.05180850997567177,
            0.6312750577926636,
            0.2925209403038025,
            0.14007443189620972,
            0.009430940262973309,
            -0.2226695418357849,
            0.14554275572299957,
            -0.10916218906641006,
            0.9509471654891968,
            -0.4543372392654419,
            0.4463315010070801,
            0.4833347797393799,
            -0.31112614274024963,
            -0.8553517460823059,
            -0.38761407136917114,
            0.008699052035808563,
            0.21433386206626892,
            0.2918364107608795,
            -0.21116191148757935,
            -0.19501160085201263,
            -0.12724705040454865,
            -0.10323915630578995,
            0.2137090116739273,
            0.019091522321105003,
            0.35061952471733093,
            -0.27824729681015015,
            -0.03736573085188866,
            0.6333974599838257,
            -0.03466276451945305,
            0.173725888133049,
            0.08301980048418045,
            -0.06233305111527443,
            0.4818492531776428
          ],
          [
            0.2819043695926666,
            0.3012731969356537,
            -0.02252848446369171,
            0.06432800740003586,
            -0.1445145457983017,
            0.2808970808982849,
            -0.015085609629750252,
            0.31544607877731323,
            -0.35849425196647644,
            -0.08254989981651306,
            0.047451119869947433,
            0.1877785474061966,
            0.20097041130065918,
            -0.048653751611709595,
            -0.07236289978027344,
            -0.05955500155687332,
            -0.25167301297187805,
            0.19663457572460175,
            -0.31332072615623474,
            0.35122281312942505,
            0.462130069732666,
            -0.01838039420545101,
            0.14700698852539062,
            0.037687886506319046,
            -0.08984524756669998,
            0.024349825456738472,
            -0.19814039766788483,
            0.0869317427277565,
            0.17769773304462433,
            -0.13097046315670013,
            0.07313655316829681,
            -0.4133078157901764,
            -0.041153378784656525,
            0.12471465021371841,
            -0.5659167766571045,
            0.06373701989650726,
            0.022980298846960068,
            -0.3269944190979004,
            0.19483309984207153,
            -0.362025648355484,
            -0.13654784858226776,
            0.42426735162734985,
            0.11052367836236954,
            -0.3285846412181854,
            -0.3085229694843292,
            0.2644127309322357,
            0.3379700481891632,
            -0.017744390293955803,
            0.11513236165046692,
            -0.3619958460330963,
            -0.11695194244384766,
            0.008998670615255833,
            0.1779526323080063,
            -0.235935777425766,
            0.08010534197092056,
            -0.3896264135837555,
            0.09697876125574112,
            0.0050211502239108086,
            -0.14140984416007996,
            -0.0598377101123333,
            0.3259083032608032,
            -0.14921584725379944,
            -0.44293510913848877,
            -0.5389649868011475
          ],
          [
            -0.3103419542312622,
            -0.32114502787590027,
            0.19020862877368927,
            -0.19044046103954315,
            -0.10658083856105804,
            -0.20381586253643036,
            -0.3460314869880676,
            -0.37071123719215393,
            0.20087739825248718,
            0.0597987100481987,
            0.207747682929039,
            0.06381138414144516,
            0.539670467376709,
            -0.5884025692939758,
            -0.09229264408349991,
            0.13298095762729645,
            0.12584668397903442,
            -0.14532320201396942,
            -0.7317185401916504,
            -0.26376014947891235,
            -0.08667319267988205,
            -0.22091956436634064,
            0.4363529086112976,
            0.03189526125788689,
            -0.008322875946760178,
            0.18023072183132172,
            -0.4992276430130005,
            -0.38085609674453735,
            -0.37814491987228394,
            -0.2620907425880432,
            -0.39006373286247253,
            -0.44455909729003906,
            -0.04155557602643967,
            -0.3445221185684204,
            -0.179579496383667,
            -0.07320043444633484,
            -0.13826994597911835,
            -0.029255973175168037,
            -0.4054349958896637,
            0.43749549984931946,
            -0.673048734664917,
            0.10046228021383286,
            0.49423354864120483,
            0.028171217069029808,
            0.2849796712398529,
            0.41345927119255066,
            -0.49527472257614136,
            -0.13552014529705048,
            -0.14624138176441193,
            -0.10068172216415405,
            0.13146349787712097,
            -0.2905437648296356,
            0.4757179021835327,
            0.19117768108844757,
            -0.06993945688009262,
            0.008357740938663483,
            0.3981091380119324,
            -0.45008835196495056,
            -0.004320081789046526,
            0.318257600069046,
            -0.14374500513076782,
            0.04760821908712387,
            -0.196312814950943,
            -0.2578144669532776
          ],
          [
            0.04018590599298477,
            -0.26059794425964355,
            0.3654938042163849,
            -0.30137020349502563,
            -0.0895310565829277,
            -0.19356736540794373,
            0.09878914803266525,
            0.2348218858242035,
            0.12741698324680328,
            0.18056875467300415,
            -0.13237914443016052,
            0.34262022376060486,
            0.4978359341621399,
            -0.3289739489555359,
            -0.012365044094622135,
            -0.0820680782198906,
            0.023681074380874634,
            0.041822727769613266,
            -0.14711086452007294,
            0.13143056631088257,
            0.19553910195827484,
            -0.24870626628398895,
            -0.2867549657821655,
            -0.17687861621379852,
            -0.15676997601985931,
            -0.14627504348754883,
            0.2424917221069336,
            0.27618640661239624,
            -0.07304522395133972,
            -0.02400427684187889,
            -0.4020293951034546,
            -0.5657026171684265,
            0.2426290363073349,
            0.28589165210723877,
            0.21806590259075165,
            0.17249885201454163,
            -0.29061010479927063,
            -0.283970445394516,
            -0.1235114336013794,
            -0.05402042344212532,
            -0.15868082642555237,
            -0.10507525503635406,
            0.09529144316911697,
            -0.22007915377616882,
            0.053443677723407745,
            -0.628852367401123,
            -0.5946577191352844,
            -0.3551711440086365,
            0.1096784770488739,
            0.3031305968761444,
            -0.22262291610240936,
            0.41891008615493774,
            0.4729803800582886,
            -0.05456222593784332,
            0.38284823298454285,
            0.01309108268469572,
            -0.3243900239467621,
            -0.1339251697063446,
            0.4652548134326935,
            0.08773081749677658,
            -0.18701286613941193,
            0.4262959063053131,
            -0.5338289737701416,
            -0.26459524035453796
          ],
          [
            -0.1808791309595108,
            0.0742281898856163,
            0.1648520678281784,
            0.18348845839500427,
            -0.21759888529777527,
            -0.03083978034555912,
            0.17940808832645416,
            0.24180492758750916,
            -0.24983341991901398,
            -0.33051398396492004,
            -0.13420148193836212,
            0.09504038095474243,
            -0.0016156657366082072,
            -0.06181428208947182,
            -0.03257972374558449,
            -0.40076062083244324,
            0.1425079107284546,
            0.2074139416217804,
            0.024665478616952896,
            0.03630989044904709,
            -0.6152971982955933,
            -0.19966426491737366,
            -0.40548938512802124,
            0.06579425185918808,
            0.16848838329315186,
            0.21479591727256775,
            0.0983332172036171,
            -0.27298641204833984,
            0.2089272439479828,
            0.035680562257766724,
            -0.07310030609369278,
            -0.2267201691865921,
            -0.27679693698883057,
            0.033763304352760315,
            0.06539691239595413,
            -0.00709496159106493,
            0.30364757776260376,
            0.2562224864959717,
            -0.19022895395755768,
            0.10626355558633804,
            -0.39855849742889404,
            -0.18782685697078705,
            0.016698479652404785,
            0.04271988570690155,
            -0.19122906029224396,
            -0.408817321062088,
            0.14403864741325378,
            -0.33028629422187805,
            0.20022869110107422,
            0.026865847408771515,
            -0.06372816860675812,
            -0.6649335026741028,
            -0.489141047000885,
            0.026716651394963264,
            0.22345057129859924,
            -0.0785384327173233,
            0.4164380729198456,
            -0.04560462757945061,
            -0.03359972685575485,
            0.17117513716220856,
            -0.15013010799884796,
            0.07787179946899414,
            -0.05752987414598465,
            -0.1649261713027954
          ],
          [
            -0.33954447507858276,
            0.2117304801940918,
            -0.11255499720573425,
            -0.400127649307251,
            -0.12035777419805527,
            0.0583684965968132,
            -0.8184539675712585,
            -0.03787042200565338,
            0.33575302362442017,
            0.16008582711219788,
            0.1879965215921402,
            -0.1293075978755951,
            -0.40655648708343506,
            0.044632069766521454,
            -0.25117531418800354,
            0.025457920506596565,
            -0.014532863162457943,
            0.08862605690956116,
            -0.03581859916448593,
            0.47557303309440613,
            -0.3413130044937134,
            0.12069732695817947,
            0.22735106945037842,
            0.20600073039531708,
            -0.100083127617836,
            -0.15927335619926453,
            0.1089576929807663,
            0.08033964782953262,
            0.038752712309360504,
            -0.26966729760169983,
            0.20672279596328735,
            0.3330923616886139,
            -0.6690130829811096,
            -0.3833978474140167,
            0.3780077397823334,
            0.019931044429540634,
            -0.1937793642282486,
            -0.013578260317444801,
            -0.15440447628498077,
            -0.3874291777610779,
            -0.07079873979091644,
            -0.1761496216058731,
            -0.15119951963424683,
            0.09664631634950638,
            -0.17546620965003967,
            -0.28233078122138977,
            -0.6565139889717102,
            0.26779720187187195,
            0.19771455228328705,
            -0.11918570101261139,
            -0.048555731773376465,
            -0.2290043979883194,
            -0.27140867710113525,
            0.15451154112815857,
            0.007169243413954973,
            0.4702788293361664,
            0.08016175776720047,
            0.06750904768705368,
            -0.14872972667217255,
            -0.3147139549255371,
            0.07212884724140167,
            -0.048029571771621704,
            -0.45521804690361023,
            -0.08401079475879669
          ],
          [
            0.27501046657562256,
            0.15803095698356628,
            0.010002750903367996,
            -0.051818713545799255,
            -0.036651361733675,
            -0.2804889380931854,
            0.24835923314094543,
            0.12204153090715408,
            0.1518852412700653,
            0.1691325157880783,
            0.23047739267349243,
            0.2439822554588318,
            0.2225605547428131,
            -0.000312282529193908,
            -0.02360081672668457,
            0.17476585507392883,
            0.48335352540016174,
            0.03516769036650658,
            -0.07165563106536865,
            0.25061482191085815,
            0.11336629092693329,
            0.08713889122009277,
            0.1152314692735672,
            0.22034592926502228,
            0.048385653644800186,
            -0.23614397644996643,
            -0.16963118314743042,
            -0.18495579063892365,
            0.17129507660865784,
            -0.01542684342712164,
            -0.07698749750852585,
            0.05239737406373024,
            -0.5136167407035828,
            -0.13256198167800903,
            -0.13604891300201416,
            0.10641568154096603,
            0.14870819449424744,
            0.3280470073223114,
            -0.2527397572994232,
            -0.3715492784976959,
            -0.5772755146026611,
            0.182671457529068,
            0.16138774156570435,
            0.32420000433921814,
            -0.3318881392478943,
            0.159218430519104,
            -0.2605116069316864,
            -0.3224971890449524,
            0.03507770225405693,
            0.4279078245162964,
            -0.022989343851804733,
            -0.8473462462425232,
            0.11723741888999939,
            -0.07152450829744339,
            -0.06402891874313354,
            0.06542851030826569,
            0.01773911714553833,
            -0.8003069758415222,
            0.21664494276046753,
            0.12478823214769363,
            0.08148912340402603,
            0.012640201486647129,
            -0.2854924499988556,
            0.1484922170639038
          ],
          [
            0.43669459223747253,
            -0.4346279799938202,
            -0.06259505450725555,
            -0.1105412095785141,
            0.05261523276567459,
            -0.28211843967437744,
            -0.12728044390678406,
            -0.254547655582428,
            -0.00427251635119319,
            -0.3540477156639099,
            0.0971977636218071,
            0.07100225985050201,
            0.05218830704689026,
            0.13527151942253113,
            -0.06731735169887543,
            0.25885823369026184,
            -0.1280452162027359,
            -0.011438224464654922,
            -0.16696766018867493,
            0.2076195478439331,
            -0.373945027589798,
            -0.11559553444385529,
            -0.37900450825691223,
            0.3231884837150574,
            0.1886143982410431,
            0.056481100618839264,
            -0.44339311122894287,
            0.06856460869312286,
            -0.20007333159446716,
            0.423232764005661,
            -0.16589245200157166,
            -0.2970665693283081,
            -0.3208906352519989,
            -0.32288187742233276,
            -0.205055370926857,
            -0.25435346364974976,
            -0.3229465186595917,
            -0.059094760566949844,
            -0.4378122389316559,
            0.08212964981794357,
            0.1454840749502182,
            -0.09596981108188629,
            -0.08145453780889511,
            0.27487844228744507,
            0.21989738941192627,
            -0.033559367060661316,
            -0.28504452109336853,
            -0.3054623007774353,
            0.01890621706843376,
            0.14796291291713715,
            -0.14824554324150085,
            0.24488720297813416,
            -0.3268798291683197,
            0.28217756748199463,
            0.20078933238983154,
            0.22574934363365173,
            -0.10309144109487534,
            0.17816120386123657,
            -0.0660928264260292,
            0.31366869807243347,
            -0.048870038241147995,
            -0.0023779873736202717,
            0.39962318539619446,
            0.20131342113018036
          ],
          [
            -0.038214534521102905,
            -0.10264203697443008,
            0.10710455477237701,
            0.1662818193435669,
            0.07016932964324951,
            0.048809994012117386,
            0.05882018432021141,
            -0.3252825140953064,
            0.1465669721364975,
            0.33932816982269287,
            -0.03165994584560394,
            0.058673709630966187,
            -0.3781141936779022,
            -0.42310094833374023,
            -0.13601136207580566,
            0.08819586783647537,
            -0.25144925713539124,
            0.3108885884284973,
            0.08111646771430969,
            0.07908909022808075,
            0.016783377155661583,
            0.15706932544708252,
            0.0522843673825264,
            -0.009108277037739754,
            0.24527607858181,
            -0.4569389522075653,
            0.16180747747421265,
            0.01928826980292797,
            0.019642267376184464,
            0.01602279581129551,
            0.20691312849521637,
            0.01590043306350708,
            -0.14230464398860931,
            0.14402979612350464,
            -0.42058101296424866,
            -0.1349833756685257,
            -0.250616192817688,
            -0.07854703068733215,
            0.12115085124969482,
            0.1698003113269806,
            -0.03956487029790878,
            -0.21118950843811035,
            -0.5663334131240845,
            0.18390905857086182,
            0.09553101658821106,
            0.14499802887439728,
            -0.037777990102767944,
            0.11216867715120316,
            0.040107980370521545,
            -0.1161501482129097,
            -0.19103343784809113,
            -0.3499526381492615,
            -0.2482195794582367,
            0.17723850905895233,
            0.2781261205673218,
            0.12626881897449493,
            0.12719184160232544,
            0.2295617163181305,
            -0.20290276408195496,
            0.037454754114151,
            0.1293468177318573,
            -0.2081504911184311,
            -0.12968981266021729,
            -0.3292534351348877
          ],
          [
            0.2156708687543869,
            0.39656174182891846,
            0.10962075740098953,
            0.178152397274971,
            -0.09869065135717392,
            -0.1619645357131958,
            -0.27331361174583435,
            0.07518671452999115,
            -0.47994640469551086,
            -0.025518381968140602,
            -0.49618738889694214,
            -0.27105608582496643,
            0.19868166744709015,
            -0.13423193991184235,
            -0.24125567078590393,
            0.4343785047531128,
            -0.08933010697364807,
            -0.5028153657913208,
            0.2431502640247345,
            -0.3370647430419922,
            -0.19204019010066986,
            0.018684247508645058,
            0.13796882331371307,
            0.09128793329000473,
            0.1924862116575241,
            -0.0704193115234375,
            -0.11112669855356216,
            0.34598308801651,
            -0.3153530955314636,
            0.1977607160806656,
            0.32113948464393616,
            -0.09363267570734024,
            0.18423011898994446,
            -0.3256159722805023,
            0.08210297673940659,
            0.1868075579404831,
            -0.22403627634048462,
            0.11781071871519089,
            -0.2788833677768707,
            -0.30715927481651306,
            0.2227812260389328,
            0.0585336908698082,
            0.23857027292251587,
            -0.27775290608406067,
            0.2039676308631897,
            0.05854951590299606,
