{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_2",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            32
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "dense_8_input"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_8",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "weights": [
          [
            0.008460796438157558,
            0.12383267283439636,
            -0.26545581221580505,
            0.22111734747886658,
            0.06120544299483299,
            -0.325263649225235,
            0.2984549403190613,
            0.0691460445523262,
            0.22667311131954193,
            0.15536242723464966,
            -0.2937914729118347,
            -0.08452632278203964,
            -0.28876689076423645,
            0.1793639361858368,
            -0.31869742274284363,
            -0.17153793573379517,
            0.15368789434432983,
            -0.05411004647612572,
            -0.019139686599373817,
            0.006208891049027443,
            -0.12220989912748337,
            -0.10362068563699722,
            -0.2775198221206665,
            0.09961433708667755,
            -0.16446110606193542,
            -0.25169309973716736,
            -0.2563153803348541,
            0.3059948682785034,
            -0.3026804029941559,
            -0.16993625462055206,
            0.09986744076013565,
            -0.07037069648504257,
            -0.23840291798114777,
            -0.23926551640033722,
            -0.08957207947969437,
            0.07713139802217484,
            0.15508733689785004,
            0.127631276845932,
            -0.17059531807899475,
            -0.15480495989322662,
            -0.08464208990335464,
            0.04477079585194588,
            0.11013218015432358,
            -0.32581794261932373,
            -0.08227021247148514,
            -0.12512163817882538,
            -0.09253613650798798,
            0.18046709895133972,
            -0.02226138301193714,
            0.13798657059669495,
            -0.08166078478097916,
            -0.23236611485481262,
            0.11517409235239029,
            -0.02600676380097866,
            -0.03240232542157173,
            -0.06460681557655334,
            0.0071932533755898476,
            0.13767889142036438,
            -0.17617231607437134,
            0.13334858417510986,
            0.06456224620342255,
            -0.22405961155891418,
            0.13294626772403717,
            0.0007480652420781553
          ],
          [
            -0.0590503066778183,
            0.26421818137168884,
            0.04933319613337517,
            -0.1301446110010147,
            -0.14032739400863647,
            0.44739189743995667,
            0.10149209946393967,
            0.010881791822612286,
            0.037831664085388184,
            0.11193705350160599,
            -0.18371015787124634,
            -0.1045411080121994,
            0.0810423493385315,
            0.10853947699069977,
            -0.042241327464580536,
            0.1171853169798851,
            -0.3033968508243561,
            -0.014945505186915398,
            -0.07035896182060242,
            -0.22899214923381805,
            -0.3302741050720215,
            -0.20483799278736115,
            0.25958505272865295,
            0.24830755591392517,
            0.007438089698553085,
            -0.16366884112358093,
            -0.018789704889059067,
            -0.3820790946483612,
            -0.054844968020915985,
            -0.1096385046839714,
            -0.12387865036725998,
            0.11142367124557495,
            0.10126473009586334,
            0.04881544038653374,
            -0.08314394950866699,
            -0.22024255990982056,
            0.006931861862540245,
            -0.19419163465499878,
            -0.0601579025387764,
            0.01927204802632332,
            0.05172544717788696,
            0.10516548901796341,
            -0.26273322105407715,
            -0.0078215217217803,
            -0.1869756132364273,
            -0.28109490871429443,
            -0.896071195602417,
            0.3003619313240051,
            -0.10918429493904114,
            -0.18718218803405762,
            0.6785592436790466,
            -0.16399931907653809,
            0.51749187707901,
            -0.22008125483989716,
            -0.12593689560890198,
            -0.2856825292110443,
            0.028148286044597626,
            -0.006416674703359604,
            0.014442742802202702,
            0.1981092095375061,
            -0.22267916798591614,
            0.1864529848098755,
            0.35067328810691833,
            0.09379489719867706
          ],
          [
            0.34214237332344055,
            -0.20931006968021393,
            0.5559792518615723,
            0.1918904185295105,
            -0.12981344759464264,
            -0.5285487771034241,
            -0.18619325757026672,
            0.27819502353668213,
            -0.11613406985998154,
            -0.3960415720939636,
            -0.23059803247451782,
            -0.15581655502319336,
            0.24366232752799988,
            0.20438507199287415,
            0.12785132229328156,
            -0.3201133906841278,
            -0.09071063995361328,
            -0.6443704962730408,
            0.4171563982963562,
            0.05296758934855461,
            0.21874895691871643,
            0.08398851007223129,
            -0.017858238890767097,
            0.0005098845576867461,
            -0.214557483792305,
            0.3021632134914398,
            -0.23124563694000244,
            -0.45663097500801086,
            0.045862141996622086,
            0.5057355165481567,
            0.4683901369571686,
            -0.5684189200401306,
            0.5252115726470947,
            0.006493657827377319,
            -0.7812844514846802,
            -0.14520440995693207,
            0.08408454805612564,
            0.011138495057821274,
            0.037696473300457,
            0.09935712814331055,
            0.13701100647449493,
            -0.09703261405229568,
            0.13051003217697144,
            0.4080198407173157,
            -0.40009742975234985,
            0.07398142665624619,
            -0.08044403791427612,
            -0.28447824716567993,
            0.23229224979877472,
            0.033905282616615295,
            0.06732294708490372,
            0.2171013355255127,
            -0.04405828192830086,
            -0.05489548668265343,
            -0.10684109479188919,
            -0.27277496457099915,
            -0.2875452935695648,
            0.16071665287017822,
            -0.22396108508110046,
            -0.5005148649215698,
            0.27325502038002014,
            -0.13109678030014038,
            0.09919940680265427,
            -0.3064945638179779
          ],
          [
            -0.16641314327716827,
            -0.0759076476097107,
            -0.4106551706790924,
            0.06468085944652557,
            0.10219328105449677,
            -0.05223498120903969,
            -0.07709644734859467,
            -0.15285149216651917,
            -0.19844232499599457,
            -0.43438059091567993,
            0.24367782473564148,
            -0.08534087985754013,
            -0.3566114604473114,
            0.05007347837090492,
            -0.07545055449008942,
            0.17956005036830902,
            0.14955590665340424,
            0.2613471746444702,
            -0.2446785867214203,
            0.07412747293710709,
            -0.16746364533901215,
            0.45127859711647034,
            -0.27085864543914795,
            -0.14065086841583252,
            0.11668404191732407,
            0.14068719744682312,
            -0.3565583825111389,
            0.06513579934835434,
            0.1065247505903244,
            -0.13039952516555786,
            -0.03414401784539223,
            -0.018767809495329857,
            -0.06530743092298508,
            -0.27232587337493896,
            0.12182032316923141,
            0.09545276314020157,
            0.09899454563856125,
            0.057356320321559906,
            -0.0007188671152107418,
            -0.15183310210704803,
            -0.24185188114643097,
            -0.3302251398563385,
            -0.020791614428162575,
            0.08247566223144531,
            -0.11034052819013596,
            -0.5214375853538513,
            0.01468736119568348,
            0.15106603503227234,
            0.18933551013469696,
            -0.3904789984226227,
            -0.06286294013261795,
            0.10286208242177963,
            -0.17034170031547546,
            0.11141300201416016,
            0.14770977199077606,
            0.061827775090932846,
            -0.6362386345863342,
            0.03742808848619461,
            0.413997083902359,
            0.13580726087093353,
            -0.8958434462547302,
            0.05214657261967659,
            -0.3213624358177185,
            -0.2683483958244324
          ],
          [
            0.009887371212244034,
            -0.21951812505722046,
            0.07374207675457001,
            -0.4104926884174347,
            0.32382625341415405,
            -0.09187999367713928,
            -0.15266753733158112,
            -0.04606204479932785,
            0.07490488886833191,
            -0.1564042568206787,
            -0.47492361068725586,
            -0.07902786880731583,
            0.10049690306186676,
            -0.3459097445011139,
            0.1864120066165924,
            0.10927975177764893,
            0.11635422706604004,
            0.143023282289505,
            -0.41503292322158813,
            -0.04766761139035225,
            0.22254051268100739,
            -0.46525898575782776,
            0.27411705255508423,
            -0.48760470747947693,
            -0.1456153243780136,
            0.3253556787967682,
            0.1970081925392151,
            0.03615355119109154,
            0.18133828043937683,
            -0.004102316685020924,
            -0.3753577470779419,
            -0.4619739055633545,
            -0.0913761630654335,
            -0.10776488482952118,
            -0.11098550260066986,
            -0.2828024923801422,
            0.03619825839996338,
            -0.02942708320915699,
            0.1291339248418808,
            0.11143460124731064,
            0.21815113723278046,
            -0.5224505662918091,
            0.2025570422410965,
            -0.09563754498958588,
            -0.057001106441020966,
            0.2622831165790558,
            -0.21784935891628265,
            -0.06681372225284576,
            0.36262497305870056,
            -0.14680056273937225,
            -0.2669072151184082,
            -0.26442086696624756,
            -0.2708127796649933,
            0.10776028782129288,
            0.15639913082122803,
            0.12355434894561768,
            -0.5111193656921387,
            0.07621294260025024,
            -0.040538057684898376,
            0.13542340695858002,
            -0.017532994970679283,
            0.29569029808044434,
            -0.1887485533952713,
            -0.16402189433574677
          ],
          [
            0.3623596727848053,
            -0.09743557870388031,
            0.45548170804977417,
            -0.897946834564209,
            -0.40793368220329285,
            -0.10884805768728256,
            0.1964571326971054,
            0.34182286262512207,
            -0.17090919613838196,
            0.406836599111557,
            0.03255974128842354,
            0.4060482084751129,
            0.27851593494415283,
            -0.05836033448576927,
            0.07568354159593582,
            0.5132177472114563,
            -0.5711221098899841,
            0.2776198387145996,
            0.10513418167829514,
            0.08159133046865463,
            0.06597843021154404,
            -0.028611917048692703,
            -0.5239121317863464,
            -0.752716064453125,
            0.015326837077736855,
            0.10057811439037323,
            -0.21247051656246185,
            -0.2675183415412903,
            0.3331233561038971,
            0.5419229865074158,
            0.19931375980377197,
            -0.06805605441331863,
            0.6237246990203857,
            0.12171196937561035,
            -1.2201954126358032,
            -0.5364624857902527,
            -0.24558193981647491,
            0.35269930958747864,
            0.24743123352527618,
            -0.3473217785358429,
            0.7053939700126648,
            -0.16884927451610565,
            0.008076710626482964,
            -0.6639270782470703,
            0.047291986644268036,
            0.2971305847167969,
            0.31495076417922974,
            -0.42980924248695374,
            0.2649986147880554,
            0.3251512348651886,
            -0.0068833795376122,
            -0.22192814946174622,
            -0.025171278044581413,
            -0.22033314406871796,
            -0.034296922385692596,
            0.12835045158863068,
            0.4046919047832489,
            -0.24358242750167847,
            -0.08489038795232773,
            -0.4444918632507324,
            -0.03248444199562073,
            -0.3114883601665497,
            -0.42289209365844727,
            0.2024674415588379
          ],
          [
            0.19626694917678833,
            -0.588909387588501,
            0.32913386821746826,
            0.11832413822412491,
            0.006371448282152414,
            -0.0936211422085762,
            -0.034213002771139145,
            0.2554663419723511,
            -0.24673029780387878,
            0.10323362797498703,
            0.19610002636909485,
            -0.4921150505542755,
            0.3197349011898041,
            -0.03255932405591011,
            0.36410167813301086,
            -0.2788856029510498,
            -0.10140117257833481,
            -0.12952591478824615,
            -0.24260227382183075,
            0.10787387192249298,
            0.14474795758724213,
            0.018916282802820206,
            0.1569405347108841,
            0.1497221440076828,
            0.25391995906829834,
            0.32692742347717285,
            0.44076982140541077,
            0.02507409080862999,
            -0.02605963870882988,
            0.1708419770002365,
            0.2977755665779114,
            0.08399610221385956,
            -0.09582144767045975,
            0.33786946535110474,
            0.42094144225120544,
            -0.19831818342208862,
            -0.00318955909460783,
            -0.060118794441223145,
            0.3720691204071045,
            0.058609895408153534,
            -0.42269206047058105,
            0.3004057705402374,
            0.0761285349726677,
            -0.6973976492881775,
            -0.37283462285995483,
            0.0288714412599802,
            0.15618324279785156,
            -0.1874816119670868,
            0.41442301869392395,
            -0.22284506261348724,
            0.26322218775749207,
            0.04937620088458061,
            -0.16465389728546143,
            -0.11830855906009674,
            -0.4942537546157837,
            -0.2604941427707672,
            0.06376615911722183,
            -0.1786728948354721,
            0.5525673031806946,
            0.16089443862438202,
            0.1932433694601059,
            0.22697411477565765,
            0.18531952798366547,
            -0.6759134531021118
          ],
          [
            -0.12445349246263504,
            0.19104932248592377,
            -0.5428258776664734,
            -0.07517345249652863,
            -0.4183613657951355,
            -0.24863213300704956,
            0.010342604480683804,
            -0.0032108852174133062,
            -0.08848553150892258,
            0.03739812597632408,
            0.3410971760749817,
            -0.03241259232163429,
            -0.18999630212783813,
            0.3263174295425415,
            -0.3015458583831787,
            -0.3185575604438782,
            -0.08029939979314804,
            -0.11220041662454605,
            -0.03636316955089569,
            0.15604330599308014,
            0.21045216917991638,
            -0.4349358379840851,
            -0.13452503085136414,
            0.1560760885477066,
            -0.4336664378643036,
            -0.18178540468215942,
            -0.035445135086774826,
            -0.33499816060066223,
            -0.025111127644777298,
            -0.3848293423652649,
            0.08308205008506775,
            0.1860990822315216,
            -0.0541103295981884,
            -0.03446299582719803,
            -0.03163662925362587,
            0.07454995810985565,
            0.18301692605018616,
            -0.36041563749313354,
            0.13657192885875702,
            -0.43300867080688477,
            0.1437407284975052,
            -0.14299039542675018,
            -0.07479703426361084,
            0.288339763879776,
            -0.46045294404029846,
            -0.31351858377456665,
            0.10433324426412582,
            -0.2885262668132782,
            0.1181572750210762,
            -0.02926008403301239,
            -0.25037717819213867,
            0.02458847127854824,
            0.1970280408859253,
            -0.5598350763320923,
            -0.29125985503196716,
            -0.09502629190683365,
            -0.3999590277671814,
            -0.12725788354873657,
            -0.10439817607402802,
            0.20859287679195404,
            -0.010028837248682976,
            -0.03736179322004318,
            0.35691961646080017,
            0.15833985805511475
          ],
          [
            0.14731580018997192,
            0.10614526271820068,
            -0.022833645343780518,
            0.17318594455718994,
            0.18474096059799194,
            0.062338054180145264,
            0.0011789798736572266,
            -0.1615837812423706,
            -0.02978360652923584,
            -0.11889880895614624,
            -0.13868701457977295,
            0.17701566219329834,
            -0.09488308429718018,
            -0.010453999042510986,
            -0.10560643672943115,
            -0.23891454935073853,
            0.07825469970703125,
            -0.05064946413040161,
            0.06193357706069946,
            0.044700443744659424,
            0.08651065826416016,
            -0.17930495738983154,
            0.12439000606536865,
            -0.09340429306030273,
            -0.09641104936599731,
            -0.1819106936454773,
            -0.005099952220916748,
            0.22630727291107178,
            -0.12189334630966187,
            -0.11152750253677368,
            -0.009875595569610596,
            -0.21486389636993408,
            -0.13762784004211426,
            0.18407583236694336,
            -0.12031584978103638,
            0.24632060527801514,
            -0.05891209840774536,
            0.10018306970596313,
            -0.1683659553527832,
            0.08224916458129883,
            -0.1993977427482605,
            0.028044402599334717,
            -0.1930248737335205,
            0.16414284706115723,
            0.23101592063903809,
            0.02690434455871582,
            0.16181892156600952,
            0.1780608892440796,
            -0.03621947765350342,
            -0.14721637964248657,
            -0.1348782777786255,
            0.15403079986572266,
            -0.08469951152801514,
            -0.19151675701141357,
            0.15135329961776733,
            -0.07298952341079712,
            0.17219221591949463,
            -0.09054887294769287,
            0.010434508323669434,
            0.11632108688354492,
            -0.03385353088378906,
            -0.23841577768325806,
            -0.046977996826171875,
            0.18162822723388672
          ],
          [
            -0.29385891556739807,
            -0.46052679419517517,
            -0.08961903303861618,
            0.23666566610336304,
            0.28317201137542725,
            -0.4613756537437439,
            -0.21355625987052917,
            0.16498039662837982,
            -0.12128002196550369,
            -0.1894320398569107,
            0.46821627020835876,
            -0.5835072994232178,
            0.09355577081441879,
            0.012311391532421112,
            0.221104696393013,
            0.15378236770629883,
            -0.07224948704242706,
            0.11827124655246735,
            -0.182627335190773,
            -0.01026124507188797,
            -0.23850104212760925,
            -0.09677127748727798,
            -0.2222670614719391,
            -0.11612686514854431,
            0.2250327467918396,
            0.32960447669029236,
            -0.11008630692958832,
            0.385518342256546,
            0.4130537509918213,
            -0.016758404672145844,
            -0.27870115637779236,
            -0.013982814736664295,
            -0.03123977966606617,
            -0.6539918780326843,
            -0.08342090249061584,
            0.21551306545734406,
            -0.14247046411037445,
            -0.16992801427841187,
            0.11551498621702194,
            -0.13801182806491852,
            0.1394805908203125,
            0.17668238282203674,
            0.42888200283050537,
            0.2950873076915741,
            0.3361586332321167,
            0.45999255776405334,
            -0.36509013175964355,
            0.019244957715272903,
            0.13357898592948914,
            0.3883606195449829,
            -0.7380884289741516,
            0.004339383915066719,
            0.3870631158351898,
            0.4831402599811554,
            0.3591027855873108,
            -0.15157699584960938,
            0.3223188519477844,
            0.002600644715130329,
            0.040104977786540985,
            -0.39201000332832336,
            -0.19769544899463654,
            0.26841846108436584,
            -0.36907386779785156,
            -0.4388427138328552
          ],
          [
            0.11169005930423737,
            0.34407058358192444,
            0.05738017335534096,
            0.0003321903059259057,
            -0.45220687985420227,
            0.5794302821159363,
            0.30893567204475403,
            -0.08393217623233795,
            0.027449343353509903,
            0.24930523335933685,
            -0.11696413904428482,
            0.2616449296474457,
            0.32448574900627136,
            0.06898640096187592,
            0.2868267297744751,
            0.15593647956848145,
            -0.15883339941501617,
            -0.04663553461432457,
            -0.08243118226528168,
            0.43649667501449585,
            0.12632128596305847,
            0.4107193946838379,
            -0.13812468945980072,
            0.2164577841758728,
            0.15377674996852875,
            0.10277032852172852,
            -0.35446035861968994,
            -0.310163676738739,
            0.05285978317260742,
            0.006924176122993231,
            -0.3957515060901642,
            -0.2887800633907318,
            -0.19714346528053284,
            0.5738451480865479,
            0.34059348702430725,
            -0.12863439321517944,
            -0.017229637131094933,
            0.0615086667239666,
            -0.18289510905742645,
            -0.2426416426897049,
            -0.34164249897003174,
            0.23593397438526154,
            -0.3435840904712677,
            -0.4294886887073517,
            -0.30170291662216187,
            0.17729255557060242,
            0.3539213240146637,
            0.23308853805065155,
            0.1710832715034485,
            -0.16934248805046082,
            0.7086635231971741,
            0.45810893177986145,
            0.1808025985956192,
            -0.5592833757400513,
            -0.1123611256480217,
            0.21575236320495605,
            -0.5519625544548035,
            -0.42219221591949463,
            -0.028150225058197975,
            -0.10237119346857071,
            0.3084114193916321,
            -0.5291799306869507,
            0.39857274293899536,
            0.2743220031261444
          ],
          [
            0.3746642470359802,
            0.02879255823791027,
            -0.1554524451494217,
            0.17144660651683807,
            -0.21050065755844116,
            0.3344305157661438,
            0.05111999809741974,
            -0.0534277968108654,
            0.28998515009880066,
            0.20106802880764008,
            -0.10570936650037766,
            0.0363498218357563,
            -0.11751764267683029,
            -0.18532556295394897,
            -0.25337621569633484,
            -0.5924254655838013,
            0.09398016333580017,
            0.46498289704322815,
            -0.08616515249013901,
            -0.04608874395489693,
            -0.03407563269138336,
            -0.6065726280212402,
            0.25804781913757324,
            -0.08740344643592834,
            -0.3479097783565521,
            -0.048440732061862946,
            -0.15567785501480103,
            -0.005100950598716736,
            -0.04641176760196686,
            0.13207900524139404,
            0.2549861669540405,
            0.23085108399391174,
            -0.09604813158512115,
            -0.3534823954105377,
            -0.4737541079521179,
            -0.13145314157009125,
            -0.4972935914993286,
            0.35693079233169556,
            0.08695967495441437,
            0.07340744137763977,
            -0.18455979228019714,
            -0.06845290213823318,
            -0.10757050663232803,
            0.26662832498550415,
            -0.035813234746456146,
            -0.42894551157951355,
            0.25046348571777344,
            -0.03989429399371147,
            0.19536708295345306,
            0.17894136905670166,
            -0.46595221757888794,
            -0.4592338502407074,
            0.11016999185085297,
            -0.46181756258010864,
            0.1410427838563919,
            0.19490396976470947,
            -0.27143487334251404,
            0.45225998759269714,
            -0.25194868445396423,
            -0.6241775751113892,
            -0.055321719497442245,
            -0.1665685623884201,
            -0.414739191532135,
            0.14671690762043
          ],
          [
            0.039161957800388336,
            -0.2112206071615219,
            0.10641438513994217,
            -0.010990996845066547,
            0.2354927510023117,
            -0.10862983018159866,
            -0.19085325300693512,
            -0.0949808731675148,
            -0.06917093694210052,
            0.18234781920909882,
            0.29421913623809814,
            -0.27072861790657043,
            0.3288906216621399,
            -0.48205339908599854,
            0.46379876136779785,
            0.004074685275554657,
            0.17005568742752075,
            0.09140489995479584,
            -0.1283685266971588,
            0.007813164964318275,
            -0.036312125623226166,
            0.1025608628988266,
            0.2805660665035248,
            0.1326238363981247,
            -0.17020002007484436,
            -0.5477363467216492,
            -0.20368751883506775,
            0.16626684367656708,
            0.3290950059890747,
            -0.1580691635608673,
            -0.07606156170368195,
            0.5079461336135864,
            0.16355790197849274,
            0.058489274233579636,
            0.05303497239947319,
            0.2151990830898285,
            -0.27006906270980835,
            -0.3132384121417999,
            -0.06503544002771378,
            -0.12254656106233597,
            0.07514076679944992,
            0.2525878846645355,
            0.11522877216339111,
            -0.1549471765756607,
            -0.2718982398509979,
            -0.12349564582109451,
            -0.35211822390556335,
            -0.19524049758911133,
            0.008905633352696896,
            0.03970932215452194,
            0.3050104081630707,
            0.002982682315632701,
            0.14379896223545074,
            -0.02017938904464245,
            0.207651749253273,
            0.2657219469547272,
            0.036627478897571564,
            -0.47365620732307434,
            -0.3287748694419861,
            0.4127909541130066,
            -0.026087559759616852,
            0.08283042907714844,
            0.3294755816459656,
            -0.1418667435646057
          ],
          [
            0.4769395887851715,
            -0.08477389812469482,
            0.30149972438812256,
            -0.1441676914691925,
            0.0942872017621994,
            -0.5456104874610901,
            -0.32518118619918823,
            0.36821773648262024,
            0.027299484238028526,
            0.24266156554222107,
            -0.44560548663139343,
            -0.21493558585643768,
            0.10819870978593826,
            -0.5912578105926514,
            -0.19824355840682983,
            0.014444198459386826,
            -0.23169702291488647,
            -0.5963634848594666,
            -0.0013663003919646144,
            0.16520844399929047,
            0.6258220076560974,
            0.14913226664066315,
            -0.4556873142719269,
            0.04311612248420715,
            0.386838436126709,
            -0.19554424285888672,
            -0.29572275280952454,
            -0.6218429803848267,
            0.40820756554603577,
            0.360676109790802,
            0.24410583078861237,
            -0.062272071838378906,
            -0.5308142304420471,
            -0.03245304152369499,
            0.14966508746147156,
            -0.23820053040981293,
            0.43208321928977966,
            -0.1895332783460617,
            0.05675099045038223,
            -0.42444220185279846,
            -0.23301440477371216,
            0.006720263510942459,
            -0.3108837902545929,
            0.21369078755378723,
            -0.5536741614341736,
            -0.18676313757896423,
            0.12291305512189865,
            -0.06765367835760117,
            0.45948147773742676,
            -0.6721819043159485,
            0.14007225632667542,
            0.1914217174053192,
            -0.1250019520521164,
            -0.26636359095573425,
            -0.185504749417305,
            -0.6714164018630981,
            -0.4438669681549072,
            -0.8313568234443665,
            0.18395856022834778,
            -0.25082576274871826,
            -0.4254775643348694,
            -0.49703168869018555,
            -0.044023167341947556,
            0.1889350861310959
          ],
          [
            0.006614833138883114,
            -0.25213661789894104,
            -0.2049388736486435,
            -0.275137335062027,
            -0.17804858088493347,
            -0.14446450769901276,
            -0.14565922319889069,
            -0.017617719247937202,
            -0.21084360778331757,
            0.09499233216047287,
            -0.07370643317699432,
            0.0945606604218483,
            -0.040596477687358856,
            -0.21716858446598053,
            0.20594243705272675,
            0.12762901186943054,
            -0.2260066419839859,
            -0.6482505202293396,
            -0.1277240812778473,
            0.26158130168914795,
            -0.1737956404685974,
            -0.10568418353796005,
            0.02121228165924549,
            -0.16461797058582306,
            -0.14560921490192413,
            0.06938329339027405,
            -0.18393678963184357,
            -0.06254412978887558,
            -0.21822448074817657,
            -0.10648712515830994,
            -0.23309117555618286,
            -0.027356840670108795,
            -0.014819450676441193,
            -0.08236756175756454,
            -0.4748559594154358,
            -0.030395202338695526,
            -0.045497648417949677,
            -0.305237740278244,
            0.03819943219423294,
            -0.27792686223983765,
            -0.6599653363227844,
            -0.04041853919625282,
            -0.2921408414840698,
            -0.15965719521045685,
            -0.05074926093220711,
            -0.109954334795475,
            0.14850741624832153,
            -0.1504162847995758,
            -0.03322121500968933,
            0.1496514230966568,
            -0.024825410917401314,
            0.33081167936325073,
            0.15032857656478882,
            -0.2942730784416199,
            -0.2608965337276459,
            -0.030638165771961212,
            -0.35823854804039,
            -0.3982979953289032,
            0.13422124087810516,
            0.1245010495185852,
            -0.48516973853111267,
            -0.04562656581401825,
            -0.04353432357311249,
            -0.18222828209400177
          ],
          [
            0.02303357981145382,
            0.1657893806695938,
            0.08190391957759857,
            -0.2850964367389679,
            0.12759943306446075,
            0.3626771569252014,
            0.24024267494678497,
            -0.13934831321239471,
            0.06000332534313202,
            0.1625768393278122,
            0.36518821120262146,
            0.12238476425409317,
            -0.17734403908252716,
            -0.2208663523197174,
            -0.23565535247325897,
            0.3153279721736908,
            -0.06288422644138336,
            -0.08500952273607254,
            -0.11271330714225769,
            -0.5529727339744568,
            -0.0012743233237415552,
            0.006382821127772331,
            0.44957196712493896,
            -0.032014891505241394,
            -0.08944382518529892,
            -0.0042512244544923306,
            0.04130744934082031,
            -0.19455759227275848,
            -0.2809690833091736,
            0.0654822364449501,
            -0.41501787304878235,
            0.0006435802788473666,
            0.2562727928161621,
            0.3013252317905426,
            -0.10467443615198135,
            0.010409258306026459,
            0.24895867705345154,
            0.10484762489795685,
            0.16485218703746796,
            -0.17004233598709106,
            -0.28844285011291504,
            0.027677591890096664,
            0.11920468509197235,
            0.15051020681858063,
            -0.026662541553378105,
            -0.3270221948623657,
            -0.07713544368743896,
            -0.5611299276351929,
            0.12222389876842499,
            -0.45590466260910034,
            -0.35826340317726135,
            0.40036168694496155,
            0.2076759785413742,
            -0.4647911787033081,
            0.2282014787197113,
            -0.421968013048172,
            0.3212117552757263,
            -0.0362030491232872,
            0.054376401007175446,
            -0.35707560181617737,
            0.10158286243677139,
            0.5655490756034851,
            0.07621359080076218,
            -0.0857655256986618
          ],
          [
            0.14599525928497314,
            -0.2258460521697998,
            0.0041100382804870605,
            0.16344964504241943,
            -0.11965841054916382,
            -1.4483928680419922e-05,
            0.13675671815872192,
            -0.24187779426574707,
            -0.17844218015670776,
            -0.08070772886276245,
            0.08248031139373779,
            -0.08634001016616821,
            0.10536223649978638,
            -0.05857652425765991,
            0.16420447826385498,
            -0.142656147480011,
            -0.08954954147338867,
            -0.19748759269714355,
            0.09457147121429443,
            -0.09626108407974243,
            0.19069147109985352,
            -0.06350457668304443,
            0.2045304775238037,
            0.22824668884277344,
            -0.21182161569595337,
            -0.14588969945907593,
            0.12099248170852661,
            -0.011583089828491211,
            0.16200006008148193,
            -0.05708092451095581,
            0.042254507541656494,
            -0.06279778480529785,
            0.20933204889297485,
            0.023235976696014404,
            -0.18614333868026733,
            -0.049521803855895996,
            -0.17787706851959229,
            0.11033666133880615,
            0.001236259937286377,
            0.21551591157913208,
            0.24884778261184692,
            0.20535629987716675,
            -0.16313529014587402,
            -0.22146010398864746,
            -0.00778651237487793,
            0.10008132457733154,
            0.0869443416595459,
            0.05791813135147095,
            0.000751197338104248,
            -0.1970081925392151,
            -0.117709219455719,
            -0.16071903705596924,
            0.2434263825416565,
            -0.2387559413909912,
            -0.22640681266784668,
            0.2348034381866455,
            -0.16757869720458984,
            0.12254101037979126,
            -0.2400057315826416,
            -0.19169515371322632,
            -0.006918072700500488,
            -0.14979910850524902,
            -0.1938878297805786,
            -0.06450080871582031
          ],
          [
            0.32048559188842773,
            -0.3343060314655304,
            -0.17817939817905426,
            0.039888642728328705,
            -0.4752587080001831,
            0.2209276556968689,
            0.08429975062608719,
            -0.26002010703086853,
            -0.06140749529004097,
            0.14942604303359985,
            -0.398542195558548,
            0.12196706235408783,
            0.6741043329238892,
            -0.22120492160320282,
            -0.26845628023147583,
            -0.5831977128982544,
            0.01446299534291029,
            -0.04527514427900314,
            -0.19696775078773499,
            -0.034987449645996094,
            0.25050967931747437,
            0.11135729402303696,
            -0.2706679105758667,
            0.05591444671154022,
            -0.1583106964826584,
            -0.2278134524822235,
            -0.2101447880268097,
            0.01754903607070446,
            0.3079651892185211,
            0.28394103050231934,
            -0.027350159361958504,
            -0.24603357911109924,
            0.1711517572402954,
            0.1915610134601593,
            0.3881053328514099,
            0.1680261343717575,
            0.21215349435806274,
            0.2923349440097809,
            -0.9571589231491089,
            -0.3288121521472931,
            0.43842703104019165,
            0.159320667386055,
            -0.4018297493457794,
            0.18140903115272522,
            -0.06489595770835876,
            -0.1233624666929245,
            0.4659644365310669,
            0.1202637180685997,
            -0.06102168560028076,
            0.021418292075395584,
            0.40611183643341064,
            -0.26220500469207764,
            0.14181481301784515,
            -0.338153600692749,
            0.12509490549564362,
            -0.08952363580465317,
            0.06230170652270317,
            -0.10000821948051453,
            -0.2336810827255249,
            -0.02870587818324566,
            -0.25437724590301514,
            -0.5309038162231445,
            0.26146426796913147,
            0.12225987017154694
          ],
          [
            -0.12512262165546417,
            -0.07929928600788116,
            -0.26371273398399353,
            -0.16271835565567017,
            0.4345647692680359,
            -0.24980731308460236,
            -0.27122923731803894,
            0.12971261143684387,
            0.24381676316261292,
            -0.3134901523590088,
            -0.052053969353437424,
            -0.26561418175697327,
            0.19421744346618652,
            -0.20937007665634155,
            -0.46736928820610046,
            -0.2022327184677124,
            0.17998646199703217,
            0.28576090931892395,
            0.48641958832740784,
            0.11986005306243896,
            0.09578798711299896,
            -0.0935162603855133,
            0.24167020618915558,
            -0.2903488278388977,
            0.40096917748451233,
            0.15281625092029572,
            -0.05696187913417816,
            0.2453812211751938,
            -0.0844864696264267,
            -0.09433328360319138,
            -0.05266447365283966,
            -0.3097551763057709,
            0.18340526521205902,
            -0.35617995262145996,
            -0.2510758340358734,
            0.21097654104232788,
            -0.13039518892765045,
            -0.3149644136428833,
            0.11142789572477341,
            0.2881603240966797,
            -0.30610305070877075,
            -0.17409789562225342,
            -0.14429208636283875,
            0.1860317885875702,
            0.2371424287557602,
            -0.23193368315696716,
            -0.16462792456150055,
            -0.08839616924524307,
            -0.18664047122001648,
            -0.20813974738121033,
            -0.4256800711154938,
            -0.3985522389411926,
            -0.46292757987976074,
            -0.34473931789398193,
            0.0777144581079483,
            0.08497986942529678,
            0.03459039330482483,
            0.19153784215450287,
            -0.1687117964029312,
            0.1907406598329544,
            -0.14512428641319275,
            -0.06094633787870407,
            0.13886098563671112,
            -0.4969068467617035
          ],
          [
            -0.04439341276884079,
            -0.22438061237335205,
            0.15620510280132294,
            -0.4460081160068512,
            -0.08448325842618942,
            -0.03693345934152603,
            -0.019047413021326065,
            -0.16491834819316864,
            0.11080565303564072,
            -0.10296984016895294,
            -0.0008518978138454258,
            -0.20871999859809875,
            -0.22999060153961182,
            0.30814212560653687,
            0.2899463176727295,
            -0.38261061906814575,
            0.2651023268699646,
            0.07835794985294342,
            -0.14634652435779572,
            0.014729985035955906,
            0.030337369069457054,
            -0.24938960373401642,
            -0.06291943788528442,
            0.0634399875998497,
            0.08478371798992157,
            0.3301798105239868,
            0.14437195658683777,
            0.13721910119056702,
            -0.07286833226680756,
            0.2761772572994232,
            -0.12462326884269714,
            0.2055395543575287,
            0.15063486993312836,
            -0.05498512461781502,
            0.20740631222724915,
            -0.22450165450572968,
            0.0030087255872786045,
            -0.11790570616722107,
            0.1979098916053772,
            -0.2995747923851013,
            0.02003340609371662,
            -0.4836096465587616,
            -0.07876552641391754,
            0.11401408165693283,
            -0.4978236258029938,
            0.1363706886768341,
            0.21051040291786194,
            -0.14892052114009857,
            0.20093482732772827,
            -0.16269101202487946,
            -0.20035183429718018,
            -0.17354583740234375,
            -0.04429749771952629,
            -0.13072356581687927,
            -0.10647096484899521,
            -0.5106070041656494,
            -0.030335133895277977,
            -0.2501109838485718,
            -0.11528068035840988,
            -0.07794984430074692,
            -0.16811686754226685,
            -0.18091103434562683,
            0.24256214499473572,
            0.16850201785564423
          ],
          [
            0.09211871773004532,
            0.06158014386892319,
            0.1683930605649948,
            -0.10989286750555038,
            -0.1954028457403183,
            0.42280313372612,
            -0.0645434558391571,
            0.00456558633595705,
            0.19932304322719574,
            0.0071788690984249115,
            -0.11452926695346832,
            0.204097181558609,
            -0.023214489221572876,
            -0.052950937300920486,
            0.05014437064528465,
            -0.07765509188175201,
            0.1758517175912857,
            -0.2201569378376007,
            -0.08109201490879059,
            -0.9995920658111572,
            0.09895452857017517,
            -0.2221728414297104,
            -0.07886362075805664,
            -0.4444405138492584,
            0.21221674978733063,
            0.03131142631173134,
            -0.4173445403575897,
            -0.10146693140268326,
            -0.003549240529537201,
            0.1360245794057846,
            0.13931743800640106,
            0.3962445557117462,
            0.10781563073396683,
            0.17358936369419098,
            -0.4702495038509369,
            0.023169321939349174,
            -0.021284660324454308,
            0.16585879027843475,
            -0.06725465506315231,
            0.02728905715048313,
            -0.7039241790771484,
            -0.14953972399234772,
            0.1681881844997406,
            -0.041698157787323,
            -0.1212451308965683,
            -0.816342830657959,
            0.08205991238355637,
            0.10791235417127609,
            -0.2520919144153595,
            0.23865090310573578,
            -0.01503476407378912,
            0.12115081399679184,
            -0.21146972477436066,
            0.22490596771240234,
            -0.2655913829803467,
            0.43819326162338257,
            -0.0722835585474968,
            -0.07001128047704697,
            0.28651484847068787,
            -0.2396712750196457,
            0.2294221669435501,
            -0.18207630515098572,
            -0.13131234049797058,
            -0.051309119910001755
          ],
          [
            -0.2302146852016449,
            -0.07327140122652054,
            0.10552750527858734,
            0.286576509475708,
            0.006859488319605589,
            -0.061838433146476746,
            0.009862028993666172,
            -0.00954852532595396,
            -0.0934576541185379,
            0.051529452204704285,
            -0.010518968105316162,
            -0.2919975817203522,
            -0.0016622000839561224,
            -0.17263253033161163,
            -0.34766000509262085,
            0.18082866072654724,
            -0.1502312272787094,
            -0.022402577102184296,
            -0.36723920702934265,
            -0.4169824719429016,
            -0.14529359340667725,
            0.28251510858535767,
            0.3471054136753082,
            0.13523010909557343,
            -0.2309471070766449,
            0.08303054422140121,
            0.39868971705436707,
            -0.2667735815048218,
            -0.21288591623306274,
            0.10885334759950638,
            -0.1710570603609085,
            0.08170666545629501,
            -0.3439573645591736,
            0.0991976410150528,
            -0.27031341195106506,
            0.0650714635848999,
            -0.019882123917341232,
            0.053112249821424484,
            -0.22307226061820984,
            0.31220734119415283,
            -0.35117611289024353,
            -0.1438358724117279,
            -0.1273737996816635,
            0.32990211248397827,
            -0.0327523797750473,
            0.044616010040044785,
            0.3522659242153168,
            0.0664917603135109,
            0.059470873326063156,
            -0.24610143899917603,
            -0.273386150598526,
            -0.08308624476194382,
            0.12937630712985992,
            0.12548212707042694,
            -0.07835385948419571,
            -0.24017086625099182,
            -0.04689786210656166,
            0.025421442463994026,
            -0.0657457485795021,
            0.415147066116333,
            0.41886526346206665,
            0.04507635906338692,
            0.07912029325962067,
            0.17220450937747955
          ],
          [
            0.1872672587633133,
            -0.06524556130170822,
            0.17834989726543427,
            0.06261731684207916,
            0.13856366276741028,
            -0.9418354630470276,
            -0.015636496245861053,
            -0.1846543699502945,
            -0.3856290876865387,
            -0.6296016573905945,
            0.03541187569499016,
            0.037202827632427216,
            -0.04238942638039589,
            -0.35472390055656433,
            0.2960206866264343,
            0.08970095217227936,
            0.07682744413614273,
            -0.1916736662387848,
            0.04387259855866432,
            -0.2951274812221527,
            0.05482801795005798,
            0.10200109332799911,
            -0.2675625681877136,
            0.2087634950876236,
            -0.14233988523483276,
            -0.6361169815063477,
            -0.22022894024848938,
            -0.06933581829071045,
            0.037506353110075,
            -0.3662257492542267,
            -0.0747985914349556,
            -0.13615456223487854,
            0.04090763255953789,
            0.32128337025642395,
            -0.2901894450187683,
            0.055525388568639755,
            0.20460425317287445,
            -0.11646689474582672,
            0.1299554407596588,
            -0.22340653836727142,
            -0.09009771049022675,
            -0.11242476850748062,
            -0.13929681479930878,
