{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_3",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            32
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "dense_12_input"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_12",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "weights": [
          [
            0.08985444158315659,
            -0.17279773950576782,
            0.19765794277191162,
            0.08190307766199112,
            -0.014402994886040688,
            -0.01824158802628517,
            0.06039512902498245,
            -0.05863476172089577,
            -0.04864182323217392,
            -0.19733300805091858,
            0.08401704579591751,
            -0.06091459095478058,
            0.17482291162014008,
            -0.08377747982740402,
            -0.10755245387554169,
            -0.1292186677455902,
            -0.05802736431360245,
            -0.23262304067611694,
            0.12472384423017502,
            0.09820540994405746,
            -0.32934701442718506,
            -0.18984702229499817,
            -0.07385329902172089,
            -0.1222076341509819,
            0.07179701328277588,
            -0.15176531672477722,
            0.3036085367202759,
            0.033861193805933,
            0.023274723440408707,
            0.011537882499396801,
            -0.18286970257759094,
            0.2563812732696533,
            -0.21801362931728363,
            0.07899478077888489,
            0.0549035407602787,
            -0.10393054783344269,
            0.10972394049167633,
            -0.039514366537332535,
            0.0744316503405571,
            -0.23070718348026276,
            -0.26645997166633606,
            -0.22552849352359772,
            -0.07314513623714447,
            -0.12386342883110046,
            0.0049290889874100685,
            -0.15983596444129944,
            -0.0906280055642128,
            0.1332256942987442,
            0.02229706384241581,
            0.05351921543478966,
            0.21294830739498138,
            -0.18189331889152527,
            -0.031444765627384186,
            -0.021444955840706825,
            0.21055211126804352,
            0.154606431722641,
            -0.18928854167461395,
            0.0024680374190211296,
            0.12059511989355087,
            0.2160027176141739,
            0.11090297251939774,
            -0.14725254476070404,
            0.18233025074005127,
            0.17006616294384003
          ],
          [
            -0.07787785679101944,
            0.001582497265189886,
            0.21835142374038696,
            0.5462160706520081,
            0.4756583571434021,
            -0.052223771810531616,
            0.2791707217693329,
            -0.031773149967193604,
            -0.28093087673187256,
            -0.028817864134907722,
            -0.12844312191009521,
            0.16676108539104462,
            0.05848287418484688,
            -0.0894823893904686,
            0.1494038999080658,
            0.15982197225093842,
            0.0318995825946331,
            -0.2940138876438141,
            -0.027085285633802414,
            0.01805718243122101,
            0.18255187571048737,
            0.08860284835100174,
            0.0601540207862854,
            0.10079612582921982,
            -0.08522739261388779,
            -0.028050873428583145,
            -0.09016580879688263,
            -0.14558899402618408,
            0.09363384544849396,
            0.2556445300579071,
            0.10980401933193207,
            -0.25963613390922546,
            -0.02929525449872017,
            -0.2871306836605072,
            -0.09084261208772659,
            -0.10157176107168198,
            0.29881325364112854,
            -0.15760934352874756,
            0.3288992941379547,
            -0.36236169934272766,
            -0.19778890907764435,
            -0.04955192655324936,
            0.4511554539203644,
            -0.25581881403923035,
            0.5571655631065369,
            0.0022858225274831057,
            0.09786038845777512,
            -0.18267761170864105,
            -0.5836789011955261,
            0.1620679348707199,
            0.39634859561920166,
            0.23378825187683105,
            0.5603180527687073,
            0.38882896304130554,
            -0.24153371155261993,
            0.16627898812294006,
            0.09068828821182251,
            0.12771597504615784,
            0.0101472781971097,
            0.06936570256948471,
            0.11986039578914642,
            -0.04697171226143837,
            -0.030221499502658844,
            -0.09516972303390503
          ],
          [
            -0.12954559922218323,
            -0.11405814439058304,
            -0.29915961623191833,
            -0.2363281399011612,
            0.25346022844314575,
            -0.019945058971643448,
            -0.8164334297180176,
            0.24818158149719238,
            0.214873805642128,
            -0.08576841652393341,
            0.06366976350545883,
            0.4743013381958008,
            0.19333195686340332,
            -0.6247878074645996,
            0.05981063097715378,
            0.0250370055437088,
            -0.008135708048939705,
            -0.405402272939682,
            0.04242921248078346,
            -0.21179647743701935,
            0.18786412477493286,
            -0.046582866460084915,
            -0.048953648656606674,
            0.10620587319135666,
            -0.08500807732343674,
            0.22429990768432617,
            0.02238484099507332,
            0.21798701584339142,
            0.12670521438121796,
            0.24347423017024994,
            0.2419634908437729,
            -0.01959415338933468,
            -0.3021570146083832,
            0.08305954933166504,
            -0.02200254052877426,
            0.4596288800239563,
            0.28163573145866394,
            -0.204051673412323,
            -0.37756022810935974,
            -0.20386920869350433,
            -0.19456811249256134,
            -0.037447232753038406,
            -0.1792989820241928,
            -0.039530858397483826,
            0.01498838048428297,
            -0.24936065077781677,
            0.05961556360125542,
            0.5687669515609741,
            0.10738306492567062,
            -0.3434235453605652,
            -0.2584057152271271,
            -0.32392245531082153,
            -0.23921796679496765,
            -0.03259168937802315,
            0.053545258939266205,
            -0.036168910562992096,
            -0.05472623556852341,
            0.1267145574092865,
            -0.010070319287478924,
            -0.27757787704467773,
            0.09955225139856339,
            0.1966852992773056,
            -0.3167691230773926,
            0.2102043628692627
          ],
          [
            -0.25371289253234863,
            -0.31045570969581604,
            0.29779449105262756,
            -0.300761878490448,
            -0.2002728134393692,
            0.27501168847084045,
            -0.2379472404718399,
            -0.13235880434513092,
            -0.3386853337287903,
            -0.26905009150505066,
            -0.24180737137794495,
            0.008880743756890297,
            0.021650541573762894,
            0.4299938976764679,
            -0.056846264749765396,
            -0.07046016305685043,
            0.3026057183742523,
            0.10154695808887482,
            -0.2309650033712387,
            -0.01604805327951908,
            -0.05269463360309601,
            0.14137189090251923,
            0.02871236391365528,
            0.3823600709438324,
            0.12913388013839722,
            -0.13429397344589233,
            -0.3221774995326996,
            0.18116311728954315,
            0.06678571552038193,
            -0.5130075812339783,
            0.04962354525923729,
            -0.08501876890659332,
            0.1723000556230545,
            -0.19561079144477844,
            0.10599588602781296,
            -0.03891941159963608,
            0.03059551678597927,
            -0.01666644960641861,
            -0.08160380274057388,
            -0.02499188482761383,
            0.02292274497449398,
            0.3160743713378906,
            0.02884305827319622,
            -0.14388440549373627,
            -0.33049532771110535,
            0.5339640378952026,
            0.40349721908569336,
            0.13636977970600128,
            0.14253169298171997,
            0.19527535140514374,
            0.3980524241924286,
            0.4274402856826782,
            -0.29032304883003235,
            -0.23906871676445007,
            -0.24296268820762634,
            -0.11247418820858002,
            0.35227689146995544,
            0.25908562541007996,
            0.20257306098937988,
            0.07208026200532913,
            -0.20792482793331146,
            0.08459490537643433,
            -0.11924618482589722,
            -0.3231584429740906
          ],
          [
            -0.13524186611175537,
            0.12720990180969238,
            -0.10259231179952621,
            0.30432549118995667,
            -0.10800841450691223,
            -0.06650015711784363,
            -0.10143151879310608,
            0.032724205404520035,
            -0.33539676666259766,
            -0.08018089085817337,
            0.0075624133460223675,
            -0.1571475714445114,
            0.11328902840614319,
            -0.19740478694438934,
            -0.5315558314323425,
            -0.36095553636550903,
            0.1466589719057083,
            0.47083157300949097,
            -0.31746259331703186,
            0.4174409508705139,
            -0.16992910206317902,
            -0.20331072807312012,
            -0.28277185559272766,
            -0.017473306506872177,
            0.4988045394420624,
            0.010008919052779675,
            -1.0114014148712158,
            -0.061245452612638474,
            0.07255604863166809,
            0.12331867218017578,
            0.2892930805683136,
            0.11981365084648132,
            -0.19950070977210999,
            0.24087733030319214,
            -0.3015073835849762,
            -0.3379668593406677,
            0.11790613830089569,
            0.1965850442647934,
            -0.23783256113529205,
            -0.3629016876220703,
            0.5570310950279236,
            -0.01038634404540062,
            -0.3839317560195923,
            0.43206533789634705,
            -0.09211338311433792,
            0.12950371205806732,
            -0.0330648273229599,
            0.5027443170547485,
            -0.1273997575044632,
            -0.5342403650283813,
            0.23376598954200745,
            -0.039943281561136246,
            -0.2812612056732178,
            0.05713226646184921,
            -0.029689060524106026,
            -0.048613931983709335,
            0.13667699694633484,
            -0.3411872982978821,
            -0.30754080414772034,
            0.3057520091533661,
            -0.9323737025260925,
            -0.0792672336101532,
            0.5106104016304016,
            0.24039457738399506
          ],
          [
            -0.037289924919605255,
            -0.2274090051651001,
            -0.1390272080898285,
            -0.044498130679130554,
            0.2962798476219177,
            -0.2612610459327698,
            -0.30458053946495056,
            0.23919318616390228,
            -0.12094255536794662,
            -0.36568397283554077,
            -0.10394658148288727,
            0.21832288801670074,
            -0.32898563146591187,
            -0.05427909642457962,
            -0.5361953973770142,
            0.19943146407604218,
            0.3326532542705536,
            0.07862728834152222,
            0.10792399942874908,
            -0.6832983493804932,
            0.14988701045513153,
            -0.022380569949746132,
            0.19711098074913025,
            -0.0155903659760952,
            -0.07226857542991638,
            0.18524029850959778,
            -0.2017659693956375,
            -0.2123630940914154,
            -0.08873595297336578,
            -0.18531815707683563,
            0.1353732943534851,
            0.2773488163948059,
            -0.9040526151657104,
            -0.399549275636673,
            -0.09189985692501068,
            0.17529310286045074,
            -0.21506506204605103,
            0.14808255434036255,
            -0.005556400865316391,
            0.14704035222530365,
            0.06820385903120041,
            0.001524770399555564,
            -0.1056102067232132,
            -0.12811876833438873,
            -0.10031545162200928,
            0.014684163965284824,
            0.014236113987863064,
            -0.6092957854270935,
            0.3186231851577759,
            -0.4291836619377136,
            0.013032296672463417,
            -0.04469670355319977,
            -0.07205431908369064,
            0.28901705145835876,
            -0.2886846661567688,
            0.317113995552063,
            -0.1387254148721695,
            0.10154606401920319,
            -0.30612391233444214,
            -0.3768566846847534,
            0.024198133498430252,
            0.4137026071548462,
            0.09685081243515015,
            0.38632097840309143
          ],
          [
            -0.08345812559127808,
            -0.3478103578090668,
            -0.26863959431648254,
            -0.006475197151303291,
            -0.07871466875076294,
            0.2939804494380951,
            -0.1656000018119812,
            0.2957882881164551,
            0.0655435249209404,
            -0.31612318754196167,
            0.3539734482765198,
            -0.12282764166593552,
            -0.14470234513282776,
            -0.12924440205097198,
            -0.11879157274961472,
            -0.14734689891338348,
            -0.17626596987247467,
            0.2667856216430664,
            0.11114781349897385,
            -0.4620133936405182,
            0.12343067675828934,
            0.35894811153411865,
            0.27581849694252014,
            0.3434397578239441,
            0.14259536564350128,
            -0.027912184596061707,
            -0.5062353610992432,
            0.2508750557899475,
            -0.8016796112060547,
            -0.18019144237041473,
            0.42217761278152466,
            0.10618395358324051,
            -0.15367943048477173,
            0.30827662348747253,
            0.13064272701740265,
            -0.09637733548879623,
            0.09788297116756439,
            0.12070237100124359,
            0.19612345099449158,
            0.2728697657585144,
            0.01380191557109356,
            0.20316645503044128,
            0.1672658920288086,
            0.20133523643016815,
            0.49932220578193665,
            0.07923810929059982,
            0.10412769019603729,
            -0.0650511160492897,
            -0.2847673296928406,
            -0.15005123615264893,
            -0.32514989376068115,
            0.03801113739609718,
            0.08949681371450424,
            -0.17053057253360748,
            0.39309021830558777,
            -0.14951737225055695,
            -0.23457928001880646,
            -0.24985022842884064,
            0.15433786809444427,
            -0.031512271612882614,
            0.2404218167066574,
            0.3428690433502197,
            -0.1489740014076233,
            0.2835843861103058
          ],
          [
            0.36913710832595825,
            -0.30468013882637024,
            -0.05704423412680626,
            -0.20354032516479492,
            0.12240629643201828,
            -0.16137923300266266,
            -0.05671603977680206,
            0.1774703562259674,
            -0.0012104036286473274,
            0.28042852878570557,
            -0.23882223665714264,
            -0.025312062352895737,
            -0.07921098917722702,
            -0.3144599497318268,
            -0.09494432806968689,
            0.16920925676822662,
            -0.24484750628471375,
            0.14327260851860046,
            -0.23148944973945618,
            -0.053613949567079544,
            -0.09649375826120377,
            0.04880176857113838,
            -0.07782451063394547,
            0.26662060618400574,
            -0.086428701877594,
            0.09057851880788803,
            0.10213419049978256,
            -0.2822626531124115,
            0.5950688123703003,
            0.08499932289123535,
            0.21157537400722504,
            -0.03404201939702034,
            0.015303353779017925,
            0.31756651401519775,
            0.32049325108528137,
            0.021296974271535873,
            -0.18045790493488312,
            0.1563485711812973,
            0.1908528059720993,
            -0.05273345857858658,
            -0.05564697086811066,
            0.38547882437705994,
            -0.011179414577782154,
            -0.0949912890791893,
            -0.022754907608032227,
            0.20750585198402405,
            0.39325135946273804,
            -0.21616041660308838,
            -0.2459796816110611,
            -0.13099727034568787,
            -0.02696915902197361,
            0.29674232006073,
            0.014386740513145924,
            0.13208521902561188,
            0.11446292698383331,
            -0.32223138213157654,
            -0.5403629541397095,
            0.15095144510269165,
            -0.2887716591358185,
            0.020075056701898575,
            0.4100426435470581,
            0.004309494514018297,
            -0.004059066064655781,
            -0.5820565819740295
          ],
          [
            0.06993108987808228,
            0.028605401515960693,
            0.05963486433029175,
            -0.09022772312164307,
            0.1208428144454956,
            0.09286153316497803,
            0.020899176597595215,
            -0.22405177354812622,
            -0.18646186590194702,
            0.08069157600402832,
            -0.05300945043563843,
            0.19718700647354126,
            0.15488606691360474,
            -0.08088904619216919,
            0.056176960468292236,
            0.2345154881477356,
            -0.09713393449783325,
            -0.03608095645904541,
            -0.19155257940292358,
            -0.045510172843933105,
            -0.20822376012802124,
            0.03225308656692505,
            0.15813350677490234,
            0.06610220670700073,
            0.018125951290130615,
            0.1003606915473938,
            -0.16264837980270386,
            -0.16965723037719727,
            -0.09404158592224121,
            -0.10703432559967041,
            0.2316952347755432,
            -0.23514032363891602,
            0.1762007474899292,
            0.24505352973937988,
            -0.1728917360305786,
            -0.2118045687675476,
            0.10607635974884033,
            0.10185879468917847,
            -0.24024087190628052,
            -0.048320233821868896,
            -0.0916287899017334,
            -0.023735880851745605,
            -0.2028825283050537,
            0.13476276397705078,
            0.2348034381866455,
            0.09536689519882202,
            0.1961480975151062,
            -0.06290072202682495,
            0.11432278156280518,
            -0.21793484687805176,
            0.038466453552246094,
            -0.1631372570991516,
            -0.20722663402557373,
            -0.2378515601158142,
            -0.011428415775299072,
            -0.16389495134353638,
            -0.1407952904701233,
            -0.24540287256240845,
            -0.10049229860305786,
            0.03256118297576904,
            -0.2228769063949585,
            0.24395036697387695,
            -0.15752458572387695,
            -0.2063726782798767
          ],
          [
            0.14830777049064636,
            0.36996543407440186,
            -0.317314475774765,
            0.0745435506105423,
            -0.480459600687027,
            0.23933956027030945,
            -0.07193728536367416,
            0.009290159679949284,
            0.17175251245498657,
            0.16084787249565125,
            0.28025707602500916,
            -0.2710757255554199,
            -0.03777915984392166,
            -0.17861345410346985,
            0.0067124939523637295,
            -0.16003760695457458,
            0.14406321942806244,
            0.3774047791957855,
            -0.07596590369939804,
            -0.2087709754705429,
            0.278247207403183,
            0.2584720253944397,
            -0.08680841326713562,
            0.17718742787837982,
            -0.07829879224300385,
            0.14259584248065948,
            0.04062145948410034,
            0.003362573217600584,
            0.012156681157648563,
            -0.20120638608932495,
            0.4531755745410919,
            -0.26557713747024536,
            -0.5531081557273865,
            -0.12323614209890366,
            -0.2937904894351959,
            -0.171762615442276,
            0.22386540472507477,
            -0.022132443264126778,
            0.003908120561391115,
            0.3354570269584656,
            0.13588139414787292,
            0.07731004804372787,
            -0.34593337774276733,
            0.09397146105766296,
            -0.5571494102478027,
            0.2886892259120941,
            -0.3672347664833069,
            -0.33091452717781067,
            -0.29959481954574585,
            0.15464770793914795,
            -0.16016897559165955,
            -0.13533267378807068,
            -0.5211950540542603,
            -0.061597373336553574,
            0.13445207476615906,
            0.011380339972674847,
            -0.2944725453853607,
            -0.1391562521457672,
            -0.1394294649362564,
            -0.13403776288032532,
            0.2936727702617645,
            0.07153617590665817,
            -0.3526439666748047,
            0.09592687338590622
          ],
          [
            0.3499033749103546,
            0.3162153959274292,
            -0.335066556930542,
            0.41904857754707336,
            0.20433349907398224,
            -0.21983611583709717,
            0.4512534439563751,
            -0.054366640746593475,
            -0.363960862159729,
            0.1250307410955429,
            -0.07736048847436905,
            0.4661172032356262,
            0.4107855558395386,
            0.21019868552684784,
            0.02050001733005047,
            0.3682694435119629,
            0.4608496129512787,
            0.4779554009437561,
            0.27074792981147766,
            0.2608204483985901,
            0.025604140013456345,
            0.17488181591033936,
            0.16413366794586182,
            -0.12927989661693573,
            0.09883909672498703,
            -0.427995502948761,
            -0.01548286247998476,
            -0.4802994132041931,
            -0.16020548343658447,
            0.4728643596172333,
            -0.07928373664617538,
            0.21582412719726562,
            -0.04924854636192322,
            -0.1609596163034439,
            -0.3257772922515869,
            0.49920621514320374,
            0.5146751403808594,
            -0.7026844620704651,
            0.37560611963272095,
            0.3051586151123047,
            0.3584003150463104,
            0.058480776846408844,
            -0.10919860750436783,
            0.788640022277832,
            -0.004068110138177872,
            -0.12348179519176483,
            0.17962414026260376,
            -0.26282018423080444,
            -0.47064411640167236,
            -0.24989941716194153,
            -0.31169819831848145,
            -0.15729916095733643,
            -0.12570101022720337,
            -0.12552231550216675,
            -0.03052317537367344,
            -0.25888878107070923,
            -0.01924401894211769,
            0.0728505402803421,
            -0.40881386399269104,
            -0.023712418973445892,
            -0.2615768015384674,
            0.03808826953172684,
            -0.3697647452354431,
            -0.02706202119588852
          ],
          [
            -0.08854606002569199,
            -0.2778206169605255,
            0.07680497318506241,
            0.144568532705307,
            0.03744261711835861,
            -0.03715197741985321,
            0.32436227798461914,
            0.0018038918497040868,
            0.24926923215389252,
            0.14334508776664734,
            0.33541664481163025,
            -0.2004704773426056,
            -0.39041057229042053,
            0.2771931290626526,
            -0.07573715597391129,
            0.21507857739925385,
            0.499464213848114,
            -0.02714403159916401,
            -0.3217794597148895,
            0.29455941915512085,
            -0.044698551297187805,
            0.09440460801124573,
            -0.36430904269218445,
            -0.2305753082036972,
            -0.3590852618217468,
            0.28562846779823303,
            -0.2773975133895874,
            0.05089283734560013,
            0.210354283452034,
            -0.4585595428943634,
            -0.13775329291820526,
            0.06854280084371567,
            -0.4004928469657898,
            0.24059389531612396,
            -0.09728109836578369,
            0.365846186876297,
            -0.22304880619049072,
            -0.0733792781829834,
            0.10665878653526306,
            0.12494578212499619,
            -0.44233936071395874,
            -0.27094799280166626,
            0.1229589506983757,
            -0.13689829409122467,
            0.5691644549369812,
            -0.18378494679927826,
            -0.12131403386592865,
            -0.3827263414859772,
            0.3197569251060486,
            0.18009498715400696,
            -0.032276708632707596,
            -0.22256851196289062,
            0.21946893632411957,
            -0.2902224659919739,
            -0.12077100574970245,
            -0.03081739880144596,
            0.35718417167663574,
            0.3227672576904297,
            -0.10769271105527878,
            0.026509417220950127,
            0.3047923743724823,
            -0.04253901168704033,
            0.41214489936828613,
            0.22963334619998932
          ],
          [
            -0.23199714720249176,
            0.2258555293083191,
            0.2983820140361786,
            0.039759933948516846,
            -0.0074792299419641495,
            0.029071353375911713,
            -0.09004533290863037,
            0.4802563190460205,
            0.06767832487821579,
            -0.45528337359428406,
            0.09083054959774017,
            -0.5049597024917603,
            0.12124123424291611,
            0.040461067110300064,
            -0.42537689208984375,
            -0.24041436612606049,
            0.05230871960520744,
            -0.2890108525753021,
            -0.24362049996852875,
            -0.7590047717094421,
            -0.21362052857875824,
            -0.0172883253544569,
            0.11687438935041428,
            0.3082573413848877,
            -0.10118795931339264,
            0.39830002188682556,
            0.17851290106773376,
            -0.04521113634109497,
            0.2372075915336609,
            -0.3564099967479706,
            -0.24134023487567902,
            -0.08396855741739273,
            -0.19475069642066956,
            -0.7495064735412598,
            0.06971270591020584,
            0.03192782774567604,
            -0.35008782148361206,
            0.03727525845170021,
            -0.10309948772192001,
            -0.5102958083152771,
            -0.010240213945508003,
            0.05012154579162598,
            -0.5408440828323364,
            -0.19759970903396606,
            -0.14444762468338013,
            -0.04807467386126518,
            0.46504732966423035,
            0.08792946487665176,
            -0.10702894628047943,
            0.27183660864830017,
            -0.1817893385887146,
            0.4580218493938446,
            0.25725656747817993,
            0.17831461131572723,
            0.24014246463775635,
            0.3178909718990326,
            -0.12550602853298187,
            0.49653685092926025,
            0.24592870473861694,
            0.09646549820899963,
            0.05913292616605759,
            0.08590756356716156,
            0.47904151678085327,
            0.19221656024456024
          ],
          [
            -0.015148541890084743,
            0.01726609840989113,
            0.1413719803094864,
            0.09318801760673523,
            0.18392546474933624,
            0.08824099600315094,
            -0.03369421511888504,
            -0.1727473884820938,
            -0.1060338243842125,
            -0.05864747241139412,
            0.1370713710784912,
            0.07734295725822449,
            -0.08736623823642731,
            0.21114100515842438,
            0.04027925431728363,
            -0.2623825967311859,
            0.5599965453147888,
            -0.2395925521850586,
            0.08621682971715927,
            0.23180228471755981,
            0.2573431134223938,
            0.10148420184850693,
            -0.42217007279396057,
            0.39562666416168213,
            0.4522773325443268,
            -0.14567838609218597,
            -0.07070881873369217,
            -0.0421629473567009,
            -0.1709698885679245,
            0.33894771337509155,
            0.1113215833902359,
            0.032845232635736465,
            -0.08612342178821564,
            -0.1497514545917511,
            -0.13084697723388672,
            0.05639787018299103,
            -0.16745464503765106,
            0.0680256336927414,
            0.07734719663858414,
            -0.030213752761483192,
            -0.28776201605796814,
            0.2521798014640808,
            0.11476310342550278,
            0.18398532271385193,
            0.29928573966026306,
            -0.06519794464111328,
            0.10765691101551056,
            0.24245139956474304,
            0.05540664494037628,
            0.13806124031543732,
            -0.46594032645225525,
            0.11808165907859802,
            0.31841832399368286,
            0.08402830362319946,
            -0.015343749895691872,
            0.07161351293325424,
            0.16841870546340942,
            -0.6929144859313965,
            -0.01490413025021553,
            -0.12980510294437408,
            0.07317738980054855,
            -0.1550264060497284,
            -0.21534143388271332,
            -0.08866836875677109
          ],
          [
            0.2271694839000702,
            -0.16171030700206757,
            -0.01755315624177456,
            0.19164308905601501,
            -0.01921706646680832,
            0.24546422064304352,
            0.25323784351348877,
            -0.26759061217308044,
            -0.04553397744894028,
            0.0863272026181221,
            -0.2130136936903,
            0.07054726779460907,
            -0.15373185276985168,
            -0.10027527064085007,
            0.06634834408760071,
            0.2484421581029892,
            -0.158577099442482,
            -0.07176441699266434,
            -0.2681179344654083,
            -0.22877304255962372,
            -0.09229395538568497,
            -0.3990887999534607,
            -0.2872118651866913,
            -0.11925803869962692,
            0.05389801785349846,
            0.17105603218078613,
            0.0399671271443367,
            -0.26214200258255005,
            -0.18920759856700897,
            -0.23922565579414368,
            0.041424646973609924,
            -0.047147370874881744,
            0.12360478192567825,
            0.008446606807410717,
            0.18470656871795654,
            0.07724396884441376,
            0.16399790346622467,
            -0.49579083919525146,
            -0.09849557280540466,
            0.005956751294434071,
            0.10175693780183792,
            -0.30126678943634033,
            0.11930200457572937,
            0.2912505269050598,
            0.05087028816342354,
            -0.17916476726531982,
            0.04505854472517967,
            -0.5667091608047485,
            -0.08178950101137161,
            -0.012444932945072651,
            -0.11635152250528336,
            -0.3317338228225708,
            -0.0674230232834816,
            0.18135587871074677,
            0.12119663506746292,
            0.14945152401924133,
            -0.030579106882214546,
            0.037643611431121826,
            -0.5501800179481506,
            0.11724188178777695,
            -0.4926760494709015,
            -0.18191726505756378,
            0.026694120839238167,
            -0.19666607677936554
          ],
          [
            -0.16253747045993805,
            0.026004325598478317,
            -0.0826336219906807,
            0.048657193779945374,
            0.24496915936470032,
            -0.11321347206830978,
            0.3665217161178589,
            -0.057298194617033005,
            -0.2590104341506958,
            0.40877529978752136,
            0.12160300463438034,
            -0.33595845103263855,
            -0.241167351603508,
            0.24418297410011292,
            0.0103883882984519,
            0.49907124042510986,
            -0.2278127819299698,
            0.30167895555496216,
            0.1290508508682251,
            0.4154740273952484,
            -0.01805177330970764,
            0.289741188287735,
            0.3202762305736542,
            0.1183951124548912,
            0.3265742361545563,
            -0.23573964834213257,
            -0.5989160537719727,
            0.3608855903148651,
            0.1639622300863266,
            0.5139011740684509,
            0.11532179266214371,
            0.10403694957494736,
            -0.33733054995536804,
            -0.3641144633293152,
            0.06340904533863068,
            -0.1305554211139679,
            0.14860357344150543,
            -0.3291580379009247,
            -0.3416523337364197,
            0.004097439348697662,
            0.36178645491600037,
            0.14197991788387299,
            -0.2522239089012146,
            0.13203777372837067,
            -0.035801030695438385,
            0.4962381422519684,
            0.13021521270275116,
            0.019983408972620964,
            -0.008024998940527439,
            0.2268158197402954,
            -0.07815534621477127,
            -0.02716177888214588,
            0.2325453758239746,
            -0.0012850724160671234,
            0.16275788843631744,
            0.2028094083070755,
            0.06524496525526047,
            -0.08255736529827118,
            -0.08557990938425064,
            -0.2166418582201004,
            0.0290222130715847,
            0.013789622113108635,
            -0.1328558474779129,
            0.12070712447166443
          ],
          [
            -0.05756080150604248,
            0.15681713819503784,
            -0.13791126012802124,
            0.2323160171508789,
            -0.011163771152496338,
            0.08326655626296997,
            0.12496685981750488,
            0.02214789390563965,
            -0.2090214490890503,
            0.1661144495010376,
            -0.020281314849853516,
            0.1844121813774109,
            0.2499043345451355,
            -0.1860526204109192,
            0.07811504602432251,
            0.1962781548500061,
            -0.09619152545928955,
            -0.11329501867294312,
            -0.15389668941497803,
            0.13027185201644897,
            0.23900485038757324,
            0.22930067777633667,
            -0.1819327473640442,
            0.1301666498184204,
            -0.242681086063385,
            -0.12400412559509277,
            0.23480403423309326,
            -0.20254427194595337,
            0.1485193371772766,
            -0.03971397876739502,
            -0.005950570106506348,
            -0.22550052404403687,
            0.066042959690094,
            -0.148143470287323,
            0.22980397939682007,
            -0.20943182706832886,
            -0.19882553815841675,
            -0.03219449520111084,
            0.13828307390213013,
            -0.17075949907302856,
            -0.1649644374847412,
            0.24098420143127441,
            0.19340604543685913,
            0.23935788869857788,
            0.00041663646697998047,
            0.03955090045928955,
            -0.14281481504440308,
            -0.12079787254333496,
            0.114360511302948,
            -0.15665119886398315,
            0.06684243679046631,
            -0.009867608547210693,
            0.15970253944396973,
            -0.23455268144607544,
            -0.21354186534881592,
            0.1497972011566162,
            -0.014073491096496582,
            -0.1821388602256775,
            -0.09716969728469849,
            0.1616452932357788,
            -0.21100091934204102,
            -0.10161846876144409,
            -0.008925020694732666,
            -0.0017334222793579102
          ],
          [
            0.385163813829422,
            0.18557071685791016,
            0.10266674309968948,
            0.12948638200759888,
            0.03436129912734032,
            -0.8483421802520752,
            -0.06507279723882675,
            -0.5401520729064941,
            0.26625749468803406,
            0.26527535915374756,
            -0.3703494966030121,
            -0.04943162575364113,
            0.09080594778060913,
            0.3592759966850281,
            -0.5745276212692261,
            -0.22603031992912292,
            0.02757193148136139,
            0.1052388846874237,
            -0.3164070248603821,
            -0.06970889121294022,
            0.04826768860220909,
            -0.5983792543411255,
            0.4047797918319702,
            -0.08966974169015884,
            0.22496987879276276,
            0.3333371579647064,
            -0.3816816806793213,
            -0.0403771847486496,
            0.12853272259235382,
            0.3185037076473236,
            -0.4583839476108551,
            0.46294185519218445,
            0.001986769260838628,
            -0.4272381365299225,
            0.43265512585639954,
            0.2541036009788513,
            0.45668044686317444,
            -0.21015973389148712,
            0.3127550184726715,
            -0.41975536942481995,
            0.12248033285140991,
            -0.9522005319595337,
            0.062166400253772736,
            -0.1441727727651596,
            -0.0008957983227446675,
            -0.07188989222049713,
            0.29554980993270874,
            0.011104858480393887,
            0.40219464898109436,
            0.08055423945188522,
            -0.22622093558311462,
            -0.027497436851263046,
            0.07395806163549423,
            0.33249831199645996,
            -0.7665156722068787,
            0.1078743189573288,
            0.3025623857975006,
            -0.1753838211297989,
            -0.38853123784065247,
            0.21117708086967468,
            -0.04108140990138054,
            -0.6077573895454407,
            0.07782704383134842,
            -0.19460482895374298
          ],
          [
            -0.1813359260559082,
            -0.07229968905448914,
            0.05939692258834839,
            0.02651592530310154,
            0.11532164365053177,
            -0.09487534314393997,
            0.276370108127594,
            -0.15213321149349213,
            0.004315190017223358,
            -0.014680189080536366,
            -0.22245551645755768,
            -0.32914015650749207,
            0.24143752455711365,
            0.2632710635662079,
            0.3973400592803955,
            -0.4997725188732147,
            -0.3681544065475464,
            -0.1977408528327942,
            -0.05062189698219299,
            -0.12814423441886902,
            0.49088868498802185,
            0.24878987669944763,
            -0.07932602614164352,
            -0.12324914336204529,
            0.17879325151443481,
            0.10154351592063904,
            0.19612231850624084,
            0.2581247091293335,
            -0.5576186776161194,
            0.02811022661626339,
            0.061391331255435944,
            -0.3754321038722992,
            0.094424769282341,
            -0.42524898052215576,
            -0.6456092000007629,
            0.014788858592510223,
            -0.3171682059764862,
            0.24939554929733276,
            -0.1442764699459076,
            -0.18243545293807983,
            -0.26259031891822815,
            -0.02996661700308323,
            0.23487408459186554,
            0.16088297963142395,
            0.03391236439347267,
            0.573870837688446,
            -0.07487469911575317,
            0.18161068856716156,
            0.1905902922153473,
            0.15324518084526062,
            0.2390924096107483,
            0.2994574010372162,
            0.1381024867296219,
            -0.1569482833147049,
            -0.20808444917201996,
            0.29269030690193176,
            0.14284372329711914,
            -0.5026595592498779,
            0.0663728192448616,
            0.04018532484769821,
            -0.15625888109207153,
            0.0748925730586052,
            0.2715892195701599,
            0.1372305005788803
          ],
          [
            0.08208698779344559,
            0.06986045837402344,
            0.009877905249595642,
            -0.045450396835803986,
            -0.20207801461219788,
            -0.09911598265171051,
            -0.45647570490837097,
            -0.21026144921779633,
            0.129837304353714,
            0.05628477409482002,
            0.09860217571258545,
            0.21163250505924225,
            -0.08955343812704086,
            -0.12081602960824966,
            0.26996710896492004,
            0.17038924992084503,
            0.05287579447031021,
            0.5294906497001648,
            -0.078008733689785,
            0.02432664856314659,
            -0.34798142313957214,
            -0.07107475399971008,
            0.1353025883436203,
            0.11094745248556137,
            -0.8600473999977112,
            -0.0035157394595444202,
            -0.5378983020782471,
            -0.24410246312618256,
            -0.09256687015295029,
            0.16459599137306213,
            0.03968599811196327,
            0.352752685546875,
            0.31414979696273804,
            -0.21419525146484375,
            0.31475692987442017,
            0.07874821871519089,
            0.2643030881881714,
            0.1514665186405182,
            -0.05368289723992348,
            0.4544471800327301,
            -0.0005691369879059494,
            0.40181952714920044,
            -0.5691201090812683,
            0.2198876589536667,
            0.141584113240242,
            -0.1479816436767578,
            -0.3487620949745178,
            0.031625404953956604,
            -0.06258448958396912,
            -0.039503589272499084,
            -0.15875108540058136,
            -0.28863924741744995,
            0.1429317444562912,
            0.3004108667373657,
            -0.30886441469192505,
            0.10035009682178497,
            -0.08343775570392609,
            -0.4240961968898773,
            0.4081549048423767,
            0.08234421908855438,
            -0.3207334280014038,
            0.20444664359092712,
            -0.46253731846809387,
            0.28007832169532776
          ],
          [
            -0.13043326139450073,
            0.18512313067913055,
            0.00400546146556735,
            0.25987622141838074,
            0.01667521893978119,
            -0.06097504124045372,
            0.017657911404967308,
            -0.07235725224018097,
            -0.29177388548851013,
            0.24108320474624634,
            -0.41751575469970703,
            -0.24396231770515442,
            -0.26805466413497925,
            0.4170733392238617,
            0.11419210582971573,
            0.32335829734802246,
            0.2947322130203247,
            -0.02682434394955635,
            0.09369701147079468,
            0.06673791259527206,
            0.06789617240428925,
            0.17197586596012115,
            0.05329667404294014,
            -0.2499276101589203,
            0.3937298059463501,
            -0.22180812060832977,
            0.11608977615833282,
            0.03882064297795296,
            -0.11352460831403732,
            -0.016943827271461487,
            -0.23226778209209442,
            -0.23500563204288483,
            0.04199548065662384,
            0.35098254680633545,
            -0.4734548032283783,
            -0.31238532066345215,
            0.15564456582069397,
            0.28044700622558594,
            0.17206907272338867,
            0.3580204248428345,
            -0.005337067414075136,
            -0.2713433802127838,
            0.2705829441547394,
            -0.03628433123230934,
            0.29850897192955017,
            -0.1323472410440445,
            -0.010204627178609371,
            0.12648504972457886,
            -0.22165416181087494,
            0.19979670643806458,
            -0.3728172779083252,
            0.2410566508769989,
            0.37520965933799744,
            0.04660467058420181,
            -0.414168119430542,
            -0.12322120368480682,
            0.2783432602882385,
            0.3953125476837158,
            0.1932040899991989,
            -0.04455993324518204,
            -0.03345257416367531,
            0.2967827022075653,
            0.0584832988679409,
            -0.29862362146377563
          ],
          [
            0.0016374897677451372,
            -0.050414588302373886,
            0.02596360445022583,
            -0.19595584273338318,
            -0.04783446714282036,
            -0.3961571156978607,
            0.06210722029209137,
            0.12271567434072495,
            -0.02013392373919487,
            0.061956219375133514,
            -0.3330285847187042,
            0.12240438908338547,
            -0.16624315083026886,
            -0.17961923778057098,
            0.163119837641716,
            -0.2160090059041977,
            -0.13307802379131317,
            -0.06960917264223099,
            -0.11236774921417236,
            0.3638654351234436,
            0.3585665225982666,
            0.24795247614383698,
            0.004926800727844238,
            0.2954806983470917,
            -0.20296698808670044,
            -0.2895326614379883,
            -0.14259552955627441,
            0.13801051676273346,
            0.09803711622953415,
            0.001388849108479917,
            -0.12056219577789307,
            0.01432864274829626,
            0.26946496963500977,
            -0.322189062833786,
            0.4152300953865051,
            0.04454338178038597,
            -0.18035681545734406,
            -0.11811801791191101,
            -0.06744265556335449,
            -0.1763828694820404,
            0.09678462892770767,
            0.027692051604390144,
            0.15325354039669037,
            0.15582235157489777,
            -0.009779865853488445,
            -0.1021137461066246,
            0.28287234902381897,
            -0.4949902296066284,
            0.043036941438913345,
            -0.22238671779632568,
            -0.17269179224967957,
            0.40929681062698364,
            0.10680469870567322,
            -0.035426635295152664,
            0.030483076348900795,
            -0.11341099441051483,
            -0.08567968010902405,
            -0.05462179332971573,
            0.2620304822921753,
            -0.3214331269264221,
            0.17781628668308258,
            -0.2634555995464325,
            0.03433087840676308,
            -0.17382720112800598
          ],
          [
            0.18667063117027283,
            -0.1838941127061844,
            0.2611968219280243,
            -0.24230681359767914,
            -0.14118382334709167,
            -0.357928067445755,
            0.06337159126996994,
            0.13202793896198273,
            0.09552080929279327,
            0.6342137455940247,
            0.1031060516834259,
            0.00448585394769907,
            0.04373465105891228,
            0.08829324692487717,
            -0.25954946875572205,
            -0.6972922086715698,
            0.01723083294928074,
            0.21023789048194885,
            -0.1393340677022934,
            -0.10885190963745117,
            -0.18953914940357208,
            -0.15631872415542603,
            0.326527863740921,
            -0.04171860218048096,
            0.022816434502601624,
            -0.013627914711833,
            0.19528056681156158,
            0.09529165923595428,
            0.0073463087901473045,
            0.14561471343040466,
            -0.058041609823703766,
            0.2388339787721634,
            0.3445797562599182,
            -0.09549486637115479,
            -0.21218597888946533,
            -0.3234144151210785,
            0.1327536553144455,
            0.5570179224014282,
            -0.06364484876394272,
            -0.4950466752052307,
            -0.09908074885606766,
            0.277654230594635,
            0.08151006698608398,
            -0.39730146527290344,
            -0.3552492558956146,
